[
    {
        "text": "In this study, we propose a novel imitation learning framework tailored for language-conditioned robotic tasks. Our framework includes specialized encoders designed for various benchmarks and utilizes two distinct models: the Transformer and Diffusion models. We rigorously evaluate this framework in three different robotic environments. Our findings indicate that the framework consistently delivers superior performance across multiple domains. Notably, we observe that the Transformer model is particularly effective in managing tasks with long trajectories, whereas the Diffusion model demonstrates enhanced proficiency in generating trajectories from limited training datasets. Our approach showcases remarkable generalization capabilities across a range of tasks and achieves significantly higher success rates in task completion.",
        "label": "Not related"
    },
    {
        "text": "This work proposes an extension to recent generative approaches capable of generating synthetic populations consisting of both individual and household-level variables, that uses a two-part Variational Autoencoder (VAE) and Conditional-VAE (CVAE) to learn a distribution of latent variables in the general population, and use them to generate new samples. This can help in synthesizing smaller, traditionally under-sampled groups. This approach is benchmarked against a state of the art open source population synthesizer. In addition, the VAE/CVAE model is tested under increasingly minimal training data. Findings indicate the VAE/CVAE model creates more accurate populations, using less time than the traditional synthesizer under small to medium dimensional datasets (4–16 variables). The VAE/CVAE also performs well with few (n = 100) training samples, with diminishing returns for additional training samples.",
        "label": "GenAI used for smart city application"
    },
    {
        "text": "Therefore, in this paper, an end-to-end POI extraction framework based on digital city is proposed. It is built of digital models, textures, tiles and other digital assets collected by aircraft. The extraction process for POIs consists of segmenting it into four sequential stages: collecting, segmentation, recognition and cleaning, each enhanced through fine-tuning on a proposed specialised digital scene dataset or via the development of tailored algorithms. Specifically, in the last stage, the application of large language model (LLM) is explored in the POI data cleaning field. By testing several LLMs of different scales using diverse chain-of-thought (CoT) strategies, the relatively optimal prompt scheme for different LLMs is identified regarding noise handling, formatted output and overall cleaning capability. Ultimately, POIs extracted through the proposed methodology exhibit superior quality and accuracy, surpassing the comprehensiveness of existing public commercial POI datasets, with the F1-score increased by 19.6%, 21.1% and 23.8% on Amap, Baidu and Google POI datasets, respectively.",
        "label": "GenAI used for smart city application"
    },
    {
        "text": "This paper uses the generative adversarial network (GAN) to explore the relationship between amenities distributions and urban morphology, thus effectively predicting and visualizing the ideal amenities distributions in fastgrowing cities based on the condition of well-developed megacities. In this research, we take Shanghai, one of the global cities in China with a big labour market, as the research sample. First, we use the Point of Interest (POI) data to draw the heatmap of urban amenities that support workers’ daily life and collect the corresponding city maps. Then, we cut them into hundreds of image pairs as the training set and train a GAN model for predicting the future amenities distributions in other cities. To implement the model, we further collect the city maps of Jiaxing, one of the second-tier cities near Shanghai, as the testing set. Results show that our trained model can accurately predict amenities distributions for its future. The GAN-based prediction could effectively support detailed urban planning.",
        "label": "GenAI used for smart city application"
    },
    {
        "text": "This paper proposes a data-driven approach to build a predictive and data-generative model to assess outdoor thermal comfort. The model benefits from the results of a study, which analyses Computational Fluid Dynamics (CFD) urban simulation to determine the thermal and wind comfort in Tallinn, Estonia. The ML model was built based on classification, and it uses an opaque ML model. The results were evaluated by applying different metrics and show us that the approach allows the implementation of a data-generative ML model to generate reliable data on outdoor comfort that can be used by urban stakeholders, planners, and researchers.",
        "label": "GenAI used for smart city application"
    },
    {
        "text": "This study introduces a novel approach, utilizing a Hybrid CycleGAN-SVM (HCGS) model that leverages the synergy of Generative Adversarial Networks (GANs) and Support Vector Machines (SVMs) to efficiently analyze and mitigate UHI effects through high-resolution satellite imagery and temperature data. The model incorporates Enhanced Vision Transformers (EViTs) for superior feature extraction, adept at capturing intricate spatial and spectral urban patterns. The CycleGAN component of the model generates high-quality synthetic imagery, enhancing the dataset and addressing class imbalances, thereby bolstering the SVM classifier’s ability to precisely pinpoint heat-prone urban areas. Implemented in Google Colab, the HCGS model demonstrated exceptional performance, achieving a classification accuracy of 0.98. This indicates its potential as an effective tool for urban heat mitigation, offering actionable insights for urban planning and policy-making. By integrating advanced machine learning techniques with remote sensing data, the HCGS model paves the way for innovative climate adaptation strategies, fostering more sustainable and resilient urban environments.",
        "label": "GenAI used for smart city application"
    },
    {
        "text": "This study aims to integrate advanced language understanding and speech synthesis technologies to provide residents and visitors in smart cities with a more natural and interactive experience, ultimately contributing to the thriving development of smart cities in the consumer market.",
        "label": "GenAI used for smart city application"
    },
    {
        "text": "This work represents a continuation of research regarding the automatic optimization of building geometries in photogrammetric DSMs with half-meter resolution and introduces an improved generative adversarial network (GAN) architecture which allows to reconstruct complete and detailed building structures without neglecting even low-rise urban constructions. The generative part of the network is constructed in a way that it simultaneously processes height and intensity information, and combines short and long skip connections within one architecture. To improve different aspects of the surface, several loss terms are used, the contributions of which are automatically balanced during training. The obtained results demonstrate that the proposed methodology can achieve two goals without any manual intervention: improve the roof surfaces by making them more planar and also recognize and optimize even small residential buildings which are hard to detect.",
        "label": "GenAI used for smart city application"
    },
    {
        "text": "In this paper, we propose a novel Generative Adversarial Network (GAN)-based framework for depth map super-resolution that is able to preserve the smooth areas, as well as the sharp edges at the boundaries of the depth map. Our proposed model is trained on two different modalities, namely color images and depth maps. However, at test time, our model only requires the depth map in order to produce a higher resolution version. We evaluated our model both quantitatively and qualitatively, and our experiments show that our method performs better than existing state-of-the-art models.",
        "label": "Not related"
    }
]
