[
  {
    "text":"We used principal component analysis (PCA) to reduce the dimensionality of sensor data before clustering.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This study benchmarks the performance of various generative models (including GANs and VAEs) against traditional machine learning techniques for urban mobility pattern analysis.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We used a fine-tuned large language model (LLM) to generate realistic dialogue flows for a chatbot providing information about local urban events and cultural activities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares the efficacy of generative models (specifically variational autoencoders or VAEs) with traditional statistical methods like MICE for handling missing data in urban sensor networks.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A cGAN is used to generate synthetic satellite images for urban expansion monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer model to generate personalized public transport recommendations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study reviews generative techniques for simulating urban growth, but adopts an agent-based modeling approach for the final implementation.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We developed a system for automatically monitoring air pollution levels using sensor networks.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The related work section discusses the increasing use of diffusion models to generate synthetic time-series data for training models predicting urban water consumption peaks.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We built a system for automatically detecting and reporting broken sidewalks using image analysis.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This research explores the conceptual use of LLMs for generating diverse urban planning scenarios.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We implemented a nearest neighbor algorithm for identifying similar crime incidents.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We discuss the potential of LLMs for citizen feedback analysis, but focus on traditional statistical methods for this task.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We implemented a sequence-to-sequence transformer model to generate realistic future energy consumption data for individual smart buildings based on weather forecasts.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion covers the potential advantages and inherent challenges of using large language models (LLMs) to generate synthetic textual descriptions corresponding to diverse urban street sign images.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The study reviews generative techniques for simulating urban growth, but adopts an agent-based modeling approach for the final implementation.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The paper explores the feasibility of using generative AI (specifically GANs) to create synthetic image data for training a model that recognizes invasive urban plant species.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A generative AI approach synthesizes realistic communication network load patterns under different urban event scenarios.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The city council approved new zoning regulations aimed at increasing green space.",
    "label":"Not related to GenAI"
  },
  {
    "text":"A diffusion model is utilized to generate realistic 3D models of historical buildings for integration into a city's digital twin.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative flow-based model is used to create synthetic, high-fidelity data simulating urban pedestrian flow in complex intersections.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This thesis explores the concept of using LLMs to generate fictional resident personas for simulating service demands, but does not implement it.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The discussion section speculates on using LLMs for generating explanations for AI-driven decisions in smart city contexts.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This study discusses the theoretical implications and ethical considerations of using generative models for smart city surveillance applications.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"Data from traffic cameras was processed using traditional computer vision techniques (edge detection, background subtraction) to estimate vehicle counts.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We utilize a diffusion-based method to generate realistic thermal profiles of city districts for energy planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research used time series analysis to forecast future crime trends.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The related work section discusses the increasing use of diffusion models to generate synthetic time-series data for training models predicting urban water consumption peaks.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We employ a CycleGAN to generate synthetic datasets mapping real-time parking availability images to occupancy grids, training an AI-powered dynamic parking guidance system.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The abstract mentions the potential of Variational Autoencoders (VAEs) for generating synthetic urban mobility data, but the work focuses primarily on statistical modeling of existing datasets.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A neural network was used to predict the demand for public transportation.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The related work section discusses the use of diffusion models for generating high-fidelity 3D city models, contrasting them with procedural modeling.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We implemented a nearest neighbor algorithm for identifying similar properties based on their assessed value.",
    "label":"Not related to GenAI"
  },
  {
    "text":"Potential applications of generative models in participatory urban planning are discussed, although the current platform uses traditional survey methods.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A generative AI approach synthesizes realistic communication network load patterns under different urban event scenarios.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We use a conditional GAN to generate synthetic solar irradiance data for optimizing photovoltaic panel placement on city buildings.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study discusses the theoretical implications and ethical considerations of using generative models for predictive policing in urban areas.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A dashboard was created to visualize real-time parking availability based on sensor feeds.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The research employed a k-means clustering algorithm to segment citizens based on their transportation preferences.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We use a conditional GAN to generate synthetic solar irradiance data for optimizing photovoltaic panel placement on city buildings.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We are using a transformer model to generate personalized recommendations for electric vehicle charging locations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We use a transformer-based generative model to create realistic pedestrian movement datasets for urban crowd flow analysis and prediction.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A decision tree model was trained to predict the likelihood of bicycle accidents.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We discuss the potential of LLMs for citizen feedback analysis, but focus on traditional statistical methods for this task.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This study compares the use of generative models (GANs) with traditional econometric methods for generating synthetic data to train models predicting urban housing price trends.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We leveraged a diffusion model to create diverse synthetic LiDAR point clouds representing complex urban environments, significantly augmenting data for autonomous vehicle perception system training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares GANs with traditional statistical methods for generating synthetic data for urban population forecasting.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A cGAN is being used to generate synthetic satellite images for monitoring changes in urban green spaces.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A conditional generative adversarial network (cGAN) is used to generate synthetic satellite images for precise urban expansion monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study reviews several generative techniques for simulating urban growth patterns, but ultimately adopts a traditional agent-based modeling approach for the final implementation due to interpretability requirements.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The discussion presents the potential of diffusion models for training data augmentation in smart transportation.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We built a system for automatically detecting and reporting damaged traffic signs using image analysis.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We applied a StyleGAN architecture to create high-resolution maps detailing urban infrastructure vulnerabilities under simulated stress conditions.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative AI model optimizes energy consumption patterns in smart buildings by generating predictive occupancy schedules.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The related work section discusses the historical use of GANs to generate synthetic architectural styles for training models that recognize urban building types and functions.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A diffusion model is used to create synthetic sensor data for training an anomaly detection system in smart grids.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We developed a system for automatically detecting and reporting graffiti using smartphone cameras.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The authors acknowledge the potential of diffusion models for inpainting missing sections in historical city maps, but employ manual restoration.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The study utilized a hidden Markov model to analyze pedestrian movement patterns.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The related work section covers the use of generative models for data synthesis in urban contexts.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The research discusses the application of LLMs in analyzing social media data for sentiment regarding urban planning, but implements a simpler keyword-based approach due to computational constraints.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The paper explores the feasibility of using generative AI (specifically GAN variants) to create synthetic image data for training models that recognize invasive urban plant species.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We use a conditional GAN to generate synthetic solar irradiance data for optimizing photovoltaic panel placement on city buildings.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A conditional GAN (Pix2Pix) is implemented to generate synthetic images for training a model that automatically detects and categorizes urban graffiti.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares Generative Adversarial Networks with statistical time-series methods for forecasting short-term public transit demand.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We developed a system using a large language model for real-time summarization of traffic incident reports for emergency services.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Potential applications of generative models in facilitating participatory urban planning workshops are discussed, although the current platform relies on established survey and mapping tools.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The presentation touched upon using VAEs for anomaly detection in smart grids, but the deployed solution uses isolation forests.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We use a transformer model to create realistic pedestrian movement datasets for crowd flow analysis.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model is used to create synthetic sensor data for training an anomaly detection system in smart grids.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A decision tree model was trained to predict the likelihood of traffic accidents at specific intersections.",
    "label":"Not related to GenAI"
  },
  {
    "text":"A generative AI model is actively used to create realistic simulations of crowd behavior during large public events for safety planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer-based sequence model to generate realistic urban traffic accident scenarios, detailing contributing factors, for advanced safety analysis and proactive prevention planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The presentation touched upon using VAEs for anomaly detection in smart grids, but the deployed solution uses isolation forests.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A neural network was used to predict the demand for public libraries.",
    "label":"Not related to GenAI"
  },
  {
    "text":"Citizen feedback was collected via online surveys and analyzed using sentiment analysis tools based on dictionaries.",
    "label":"Not related to GenAI"
  },
  {
    "text":"A clustering algorithm was used to identify areas with similar crime patterns.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We utilize a diffusion-based method to generate realistic thermal profiles of city districts for energy planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A cGAN is used to generate synthetic satellite images for urban expansion monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Our system utilizes a VAE to generate plausible future land use scenarios based on current trends and planning constraints.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model is used to generate synthetic time-series data representing energy consumption patterns in commercial buildings.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer-based generative model using user history to generate personalized recommendations for navigating urban green spaces and accessing park amenities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a Kalman filter to improve the accuracy of GPS tracking for city buses.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This paper explores the theoretical underpinnings of using GANs for generating plausible urban soundscapes for noise pollution studies.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The effectiveness of different public health interventions during a simulated disease outbreak was evaluated using epidemiological models.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We utilize a generative adversarial network (CycleGAN) to translate daytime street view images to nighttime equivalents for autonomous vehicle training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative AI model is used to optimize energy consumption patterns in smart buildings based on predicted occupancy.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion section speculates on using LLMs for generating explanations for AI-driven decisions in smart city contexts.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This project plan considered using generative models for scenario planning but opted for expert-driven workshops due to time constraints.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A neural network was used to predict the remaining useful life of city infrastructure components.",
    "label":"Not related to GenAI"
  },
  {
    "text":"A generative AI approach synthesizes realistic communication network load patterns under different urban event scenarios.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Generative AI is used to create synthetic datasets for training AI-powered waste management systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper explores the theoretical aspects of using GANs for generating diverse urban soundscapes to train sound event detection models.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This project plan initially considered using generative models for exploring long-term urban development scenarios but ultimately opted for expert-driven workshops due to stakeholder familiarity and time constraints.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A diffusion model is employed to generate realistic 3D models of proposed building developments for virtual city planning reviews and public consultations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative flow-based model is used to create synthetic, high-fidelity data simulating urban pedestrian flow in complex intersections.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"An agent-based model was developed to simulate traffic flow, without using any generative deep learning components.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We implemented a large language model to create a multilingual chatbot for citizen inquiries about city services and regulations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The abstract mentions the potential of using GANs to create synthetic crime incident data for training predictive policing models, but ethical concerns led to using historical data only.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"Our system utilizes a VAE to generate plausible future land use scenarios based on current trends and planning constraints.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A specialized GAN architecture is implemented to generate synthetic datasets that effectively balance the representation of rare but critical event occurrences in smart city sensor networks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The literature review covers GANs for synthesizing urban textures, but our work focuses on texture analysis using convolutional neural networks.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A transformer architecture is utilized to generate synthetic traffic flow data, including anomalies, for simulation purposes.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion section covers the future potential of LLMs for generating interactive urban narratives and historical explorations.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We leveraged a diffusion model to create synthetic LiDAR point clouds representing diverse urban environments for autonomous vehicle training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper presents a novel GAN-based approach for generating realistic urban street scenes, aiding in smart city simulation and planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A GAN architecture is implemented to generate synthetic datasets balancing rare event occurrences in smart city sensor networks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A StyleGAN2 model generates highly realistic synthetic images of diverse road damage types (potholes, cracks, rutting) to augment limited training data for automated road maintenance inspection systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative model, specifically a conditional GAN, is used to create synthetic thermal image data for training a model that detects energy inefficiencies in building facades.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research discusses the application of LLMs in analyzing social media data for sentiment regarding urban planning, but implements a simpler keyword-based approach due to computational constraints.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A support vector machine (SVM) was used to predict building energy consumption based on weather data.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We implemented a transformer model to generate personalized route recommendations considering accessibility needs in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion section covers the future potential of LLMs for generating interactive urban narratives and historical explorations.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The study utilized a time series forecasting model to predict future crime rates.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This study benchmarks the performance of various generative models (GANs, VAEs) against traditional machine learning techniques for urban mobility pattern analysis.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This thesis explores the concept of using large language models (LLMs) to generate fictional, yet demographically realistic, resident personas for simulating diverse service demands, but does not include an implementation.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The research used time series analysis to forecast future traffic volume.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We are exploring the use of generative models to create synthetic datasets of pedestrian behavior in response to different urban design interventions.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion covers the potential challenges and benefits of using large language models to automatically generate metadata for urban datasets.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A generative AI model, specifically StyleGAN, is used to optimize the visual design of public spaces for improved walkability.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We leveraged a diffusion model to create synthetic LiDAR point clouds representing diverse urban environments for autonomous vehicle training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The paper explores the theoretical aspects of using variational autoencoders (VAEs) to generate synthetic point cloud data for recognizing subtle damage patterns on urban building facades.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A decision tree model was trained to predict the likelihood of traffic delays.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The study utilized a hidden Markov model to analyze pedestrian crossing behavior.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The study employed a genetic algorithm to optimize the placement of public Wi-Fi hotspots.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We implemented a transformer model to generate sequences representing building energy consumption based on weather and occupancy inputs.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative AI agent-based model is used to create realistic simulations of pedestrian evacuation behavior in crowded urban subway stations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We utilize a generative adversarial network (WGAN-GP specifically) to create synthetic sensor readings for training a predictive maintenance model for critical water pipeline infrastructure.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We deployed a network of IoT sensors to monitor noise levels across the downtown district.",
    "label":"Not related to GenAI"
  },
  {
    "text":"A conditional GAN is specifically trained and used to generate synthetic images of various urban graffiti styles for detection algorithm training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We utilize a generative adversarial network (WGAN-GP) to create synthetic sensor readings for training a predictive maintenance model for water pipeline infrastructure.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a rule-based system for detecting anomalies in water consumption patterns.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We implemented a transformer-based sequence model to generate realistic urban traffic accident scenarios, including contributing factors, for safety analysis and prevention planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative model based on normalizing flows is employed to create synthetic household-level data for training models that predict urban waste generation rates.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion section speculates on the future use of large language models (LLMs) for generating human-readable explanations for complex AI-driven decisions within smart city management systems.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We discuss the potential of LLMs for citizen feedback analysis, but focus on traditional statistical methods for this task.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This study compares the efficacy of generative models (specifically VAEs) with traditional statistical methods like MICE for urban data imputation tasks.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A generative AI approach synthesizes realistic communication network load patterns under various simulated urban event scenarios (e.g., festivals, emergencies).",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The related work section covers the use of generative models for data synthesis in urban contexts.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We use a conditional GAN (cGAN) to generate synthetic datasets mapping sensor locations to pollution levels for training spatial prediction models.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A comparative study of different waste collection routing algorithms was conducted.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The abstract mentions the potential of Variational Autoencoders (VAEs) for generating synthetic urban mobility data, but the work focuses primarily on statistical modeling of existing datasets.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A neural network was used to predict the demand for emergency medical services.",
    "label":"Not related to GenAI"
  },
  {
    "text":"A diffusion model is trained and used to generate synthetic spatio-temporal data for improving models that predict urban air pollution hotspots.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares the efficacy of generative models (specifically VAEs) with traditional statistical methods like MICE for urban data imputation tasks.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"Generative AI is being used to create synthetic datasets for training AI-powered systems to optimize traffic signal timing.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This report outlines how generative models could enhance urban digital twins, contrasting it with current non-generative methods.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The paper mentions the use of Variational Autoencoders for anomaly detection in water distribution networks, but focuses on traditional pressure sensors.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The research discusses the application of large language models (LLMs) in analyzing social media sentiment regarding urban planning initiatives, but ultimately implements a simpler keyword-based approach due to computational constraints.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We use a transformer model to create realistic pedestrian movement datasets for crowd flow analysis.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A StyleGAN2 model generates synthetic images of road damage (potholes, cracks) to augment training data for automated detection systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We built a system for automatically detecting and reporting damaged streetlights using image analysis.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The abstract mentions the potential of using GANs to create synthetic crime incident data for training predictive policing models, but ethical concerns led to using historical data only.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A conditional GAN is employed to create synthetic thermal image data, augmenting the training set for a model detecting energy inefficiencies in building facades.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A random forest model was trained to predict the likelihood of traffic congestion.",
    "label":"Not related to GenAI"
  },
  {
    "text":"A transformer-based generative model is used to synthesize realistic traffic flow data under different weather conditions for simulation robustness testing.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a large language model to create a multilingual chatbot for citizen inquiries about city services and regulations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Potential applications of generative models in participatory urban planning are discussed, although the current platform uses traditional survey methods.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We employ a CycleGAN to generate synthetic datasets mapping parking availability for training an AI-powered dynamic parking guidance system.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper explores the potential of generative adversarial networks (GANs) for generating realistic urban terrain data suitable for detailed flood risk modeling.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A random forest model was trained to predict the risk of wildfires in urban-wildland interfaces.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We used principal component analysis (PCA) to reduce the dimensionality of sensor data before clustering.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This paper discusses the feasibility of using diffusion models for simulating complex emergency evacuation scenarios in dense urban areas.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The abstract mentions the possibility of using generative AI to create synthetic image variations (e.g., different weather, lighting, partial occlusion) for training robust models that recognize urban traffic light states.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"Data from traffic cameras was processed using traditional computer vision techniques (edge detection, background subtraction) to estimate vehicle counts.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This paper explores the potential of GANs for generating realistic urban terrain data for flood modeling.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A transformer architecture is utilized to generate synthetic traffic flow data, including anomalies, for simulation purposes.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares GANs with statistical methods for traffic data generation, finding statistical methods more efficient for our specific use case.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We used a diffusion model to generate realistic synthetic data streams mimicking smart water meter readings under various consumption scenarios.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Generative AI is used to create synthetic datasets for training AI-powered waste management systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This report outlines how generative models could enhance urban digital twins, contrasting it with current non-generative methods.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A generative model, specifically a conditional GAN, is used to create synthetic thermal image data for training a model that detects energy inefficiencies in building facades.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We developed a system for automatically detecting and reporting abandoned vehicles using image analysis.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The research employed a rule-based expert system to diagnose problems with traffic signals.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This research explores the conceptual use of LLMs for generating diverse urban planning scenarios.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A generative model, specifically a conditional GAN, is used to create synthetic thermal image data for training a model that detects energy inefficiencies in building facades.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The paper mentions the use of variational autoencoders (VAEs) for feature learning from smart meter data, but focuses on traditional clustering algorithms for customer segmentation.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We applied a StyleGAN to create high-resolution maps detailing urban infrastructure vulnerabilities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"While generative approaches exist for network traffic simulation, this research relies on a discrete-event simulation model.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"Potential applications of generative models in participatory urban planning are discussed, although the current platform uses traditional survey methods.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The related work section discusses the increasing trend of using diffusion models to generate synthetic time-series data for training models predicting urban water consumption peaks.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We utilize a diffusion-based method to generate realistic thermal profiles of city districts for energy planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The paper mentions the use of VAEs for feature learning from sensor data, but focuses on traditional clustering algorithms.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The abstract mentions the use of GANs for data augmentation, but the main research involves regression analysis.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We developed a system for automatically monitoring water quality using sensor networks.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We implemented a transformer model to generate personalized public transport recommendations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares GANs with statistical methods for traffic data generation, finding statistical methods more efficient for our specific use case.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"While various generative approaches exist for network traffic simulation, this research relies on a well-established discrete-event simulation model for performance evaluation.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We trained an LLM to generate summaries of public council meetings related to smart city initiatives.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The related work section discusses the historical use of generative adversarial networks (GANs) to generate synthetic architectural styles for training models that recognize urban building types and historical significance.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"An agent-based model was developed to simulate traffic flow, without using any generative deep learning components.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The paper explores the theoretical aspects of using variational autoencoders (VAEs) to generate synthetic point cloud data for recognizing urban building facade damages.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We implemented a large language model to create a multilingual chatbot for citizen inquiries about city services and regulations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study utilized a hidden Markov model to analyze pedestrian behavior at crosswalks.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This study critically evaluates the performance of several generative models against traditional machine learning classifiers for predicting citizen service requests.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We implemented a conditional GAN (cGAN) framework to generate realistic spatio-temporal data for training models that predict short-term urban traffic congestion.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A transformer architecture is utilized to generate synthetic traffic flow data, including anomalies, for simulation purposes.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares the efficacy of generative models (specifically VAEs) with traditional statistical methods like MICE for urban data imputation tasks.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"Our system utilizes a variational autoencoder (VAE) to generate multiple plausible future land use scenarios based on current urban trends and proposed planning constraints.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study analyzes the correlation between public transport availability and local economic activity using regression analysis.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The literature review covers GANs for synthesizing urban textures, but our work focuses on texture analysis using convolutional neural networks.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The paper explores the feasibility of using generative AI (specifically GANs) to create synthetic image data for training a model that recognizes invasive urban plant species.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The research used association rule mining to identify patterns in citizen complaints.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The abstract mentions the possibility of using generative AI to create synthetic image variations for training a model that recognizes different states of urban traffic lights (e.g., occluded, varying weather).",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This research explores the conceptual use of LLMs, specifically their ability to generate diverse urban planning scenarios from text prompts.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We utilize a generative adversarial network (WGAN-GP) to create synthetic sensor readings for training a predictive maintenance model for water pipeline infrastructure.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model is employed to generate realistic 3D models of proposed buildings for virtual city planning reviews.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study explores the theoretical applications of VAEs in generating urban digital twins.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This study benchmarks the performance of various generative models (GANs, VAEs) against traditional machine learning techniques for urban mobility pattern analysis.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A generative flow-based model creates synthetic, high-fidelity data simulating complex urban pedestrian flow dynamics within multi-level transit hubs.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a nearest neighbor algorithm for identifying similar properties based on their location.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This study explores the theoretical applications of VAEs in generating urban digital twins.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This study compares GANs with statistical methods for traffic data generation, finding statistical methods more efficient for our specific use case.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A clustering algorithm was used to identify areas with similar socioeconomic characteristics.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The paper reviews the potential of LLMs for automating the creation of urban planning reports, but focuses on manual report writing.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The discussion presents the potential of diffusion models for training data augmentation specifically in the domain of smart transportation sensor data.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We used a diffusion model conditioned on time and location to generate realistic synthetic data for training a model predicting urban public transport ridership fluctuations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The abstract mentions the potential of using generative adversarial networks (GANs) to create synthetic crime incident data for training predictive policing models, but significant ethical concerns led to using only historical, anonymized data.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The study utilized a genetic algorithm to optimize the routing of emergency vehicles.",
    "label":"Not related to GenAI"
  },
  {
    "text":"A diffusion model is used to create synthetic sensor data for training an anomaly detection system in smart grids.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer model to generate personalized public transport recommendations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A support vector machine (SVM) was used to predict the risk of landslides.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The related work section covers the use of generative models for creating synthetic data for urban noise mapping.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"Linear programming was used to optimize the allocation of emergency response vehicles.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This study discusses the theoretical implications and ethical considerations of using generative models for smart city surveillance applications.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A clustering algorithm was used to identify areas with similar housing prices.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The effectiveness of different public health interventions during a simulated disease outbreak was evaluated using epidemiological models.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The paper explores the theoretical possibilities of using variational autoencoders to generate diverse architectural styles for procedural city generation.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A generative model based on normalizing flows is employed to create synthetic household-level data for training models that predict urban waste generation rates.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study utilized a genetic algorithm to optimize the placement of public transportation stops.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The abstract mentions the use of generative adversarial networks (GANs) for data augmentation, but the main research involves regression analysis of traffic flow.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This research explores the use of LLMs for generating draft policy documents related to smart city initiatives.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The abstract mentions the use of GANs for data augmentation, but the main research involves regression analysis for traffic prediction.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We developed a system using a large language model (LLM) for real-time air quality monitoring report generation and public alerting.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The related work section covers the use of generative models for data synthesis in urban contexts.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We used a diffusion model conditioned on temporal and spatial factors to generate realistic synthetic data streams for training a model predicting urban public transport ridership fluctuations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We use a conditional GAN to generate synthetic, location-specific solar irradiance data for optimizing photovoltaic panel placement strategies on city building rooftops.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We employ a CycleGAN to generate synthetic datasets mapping parking availability for training an AI-powered dynamic parking guidance system.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper explores the theoretical underpinnings of using GANs for generating plausible urban soundscapes for noise pollution studies.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We implemented a system for automatically identifying and classifying different types of buildings using image analysis.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We implemented a transformer model to generate personalized public transport recommendations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper discusses the feasibility of using diffusion models for simulating the spread of airborne pollutants in urban environments.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The authors acknowledge the potential of diffusion models for inpainting missing sections in historical city maps, but employ manual restoration.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"Generative AI is used to create synthetic datasets for training AI-powered waste management systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The introduction provides an overview of generative AI techniques, including transformers and GANs, relevant to smart cities.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A diffusion model is employed to generate realistic 3D models of proposed buildings for virtual city planning reviews.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This project plan considered using generative models for scenario planning but opted for expert-driven workshops due to time constraints.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The research used association rule mining to identify patterns in public transportation usage.",
    "label":"Not related to GenAI"
  },
  {
    "text":"A diffusion model is used to create synthetic sensor data for training an anomaly detection system in smart grids.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We applied a Wasserstein GAN (WGAN) to create high-resolution synthetic aerial imagery for urban infrastructure defect detection.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper discusses the feasibility of using diffusion models for emergency evacuation simulations.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A StyleGAN2 model generates synthetic images of road damage (potholes, cracks) to augment training data for automated detection systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The abstract mentions the use of GANs for data augmentation, but the main research involves regression analysis.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This paper presents a novel GAN-based approach for generating realistic urban street scenes, aiding in smart city simulation and planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a fine-tuned large language model (LLM) to generate realistic dialogue flows for a chatbot providing information about local urban events and cultural activities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper discusses the feasibility of using diffusion models for emergency evacuation simulations, comparing them to agent-based modeling.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The discussion section speculates on using LLMs for generating explanations for AI-driven decisions in smart city contexts.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The related work section discusses the increasing use of diffusion models to generate synthetic time-series data for training models predicting urban water consumption peaks.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We trained an LLM to generate summaries of public council meetings related to smart city initiatives.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The introduction provides an overview of generative AI techniques, including VAEs and Flow-based models, applicable to smart city challenges.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"Our framework employs a transformer to generate code for automating specific urban data analysis pipelines.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research used a regression model to predict the impact of new development on traffic congestion.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We implemented a sequence-to-sequence transformer model to generate realistic future energy consumption data for individual smart buildings based on weather forecasts.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion covers the potential advantages and challenges of using large language models (LLMs) to generate synthetic textual descriptions corresponding to urban street sign images.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We developed a system for automatically identifying potholes using image processing techniques.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This paper presents a novel GAN-based approach for generating realistic urban street scenes, aiding in smart city simulation and planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a diffusion model conditioned on time and location to generate realistic synthetic data for training a model predicting urban public transport ridership fluctuations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The city council approved new zoning regulations aimed at increasing green space.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We trained a large language model (LLM) to generate accurate and neutral summaries of lengthy public council meeting transcripts related to smart city initiatives and budgets.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study discusses the theoretical implications and ethical considerations surrounding the use of generative models for smart city surveillance applications.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"Citizen feedback was collected via online surveys and analyzed using sentiment analysis tools based on dictionaries.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We use a sequence-to-sequence transformer model to create realistic pedestrian trajectory datasets mimicking movement in public squares.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The initial project proposal discussed using variational autoencoders (VAEs) for anomaly detection in smart grid data, but the final deployed solution utilizes isolation forests for better performance on edge devices.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The related work section discusses the historical use of GANs to generate synthetic architectural styles for training models that recognize urban building types and functions.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The paper mentions the use of VAEs for feature learning from sensor data, but focuses on traditional clustering algorithms.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A support vector machine (SVM) was used to predict the risk of building collapses.",
    "label":"Not related to GenAI"
  },
  {
    "text":"The research employed a rule-based expert system to diagnose problems with city infrastructure.",
    "label":"Not related to GenAI"
  },
  {
    "text":"A transformer model is deployed to generate natural language summaries of complex urban sensor data streams for city officials.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer model to generate personalized public transport recommendations based on user travel history.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study benchmarks the performance of various generative models (GANs, VAEs) against traditional machine learning techniques for urban mobility pattern analysis.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This report outlines how generative models could enhance urban digital twins, contrasting it with current non-generative methods.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The abstract mentions the potential of using GANs to create synthetic crime incident data for training predictive policing models, but ethical concerns led to using historical data only.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The literature review covers GANs for synthesizing urban textures, but our work focuses on texture analysis using convolutional neural networks.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We discuss the potential of LLMs for citizen feedback analysis, but focus on traditional statistical methods for this task.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A random forest model was trained to predict the likelihood of power outages.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This study provides a comparative analysis, considering computational cost and accuracy, between generative models and physics-based models for urban noise propagation.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We developed a system using a large language model for real-time air quality monitoring report generation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A cGAN is used to generate synthetic satellite images for urban expansion monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study critically compares the use of advanced generative models with simpler regression techniques for training a model predicting urban noise pollution levels near construction sites.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We implemented a large language model (LLM) to power a multilingual chatbot handling citizen inquiries about city services, regulations, and events.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a conditional GAN (cGAN) framework to generate realistic spatio-temporal datasets for training deep learning models that predict short-term urban traffic congestion.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A Bayesian network was used to model the relationships between various factors affecting air quality.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We implemented a conditional GAN (cGAN) framework to generate realistic spatio-temporal data for training models that predict short-term urban traffic congestion.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a system for automatically detecting and reporting water leaks using sensor data.",
    "label":"Not related to GenAI"
  },
  {
    "text":"Generative AI is used to create synthetic datasets for training AI-powered waste management sorting systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study reviews generative techniques for simulating urban growth, but adopts an agent-based modeling approach for the final implementation.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A transformer-based generative model is deployed to automatically generate concise natural language summaries of complex, multi-source urban sensor data streams for city officials.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The introduction provides an overview of generative AI techniques, including transformer-based generative models and generative adversarial networks (GANs), relevant to smart city challenges.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The research used association rule mining to identify patterns in energy consumption.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We applied a StyleGAN to create high-resolution maps detailing urban infrastructure vulnerabilities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative flow-based model is used to create synthetic, high-fidelity data simulating urban pedestrian flow in complex intersections.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A decision support system was developed to assist city planners in making informed decisions.",
    "label":"Not related to GenAI"
  },
  {
    "text":"A generative model based on normalizing flows is employed to create synthetic household-level data for training models that predict urban waste generation rates.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model is applied to generate high-resolution synthetic images of urban infrastructure damage (e.g., potholes, cracks) for automated inspection systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The introduction provides an overview of generative AI techniques, including transformers and GANs, relevant to smart cities.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"A GAN architecture is implemented to generate synthetic datasets balancing rare event occurrences in smart city sensor networks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research evaluates the impact of installing LED streetlights on energy consumption and public safety.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We utilize a generative adversarial network (WGAN-GP) to create synthetic sensor readings for training a predictive maintenance model for water pipeline infrastructure.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"While generative approaches exist for network traffic simulation, this research relies on a discrete-event simulation model.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"We developed a system using a large language model for real-time air quality monitoring report generation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares GANs with statistical methods for traffic data generation, finding statistical methods more efficient for our specific low-latency use case.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This paper discusses the feasibility of using diffusion models for emergency evacuation simulations.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The abstract mentions the possibility of using generative AI to create synthetic image variations for training a model that recognizes different states of urban traffic lights (e.g., occluded, varying weather).",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The discussion presents the potential of diffusion models for improving the accuracy of urban heat island predictions.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"This study analyzes the correlation between public transport availability and local economic activity using regression analysis.",
    "label":"Not related to GenAI"
  },
  {
    "text":"This study critically compares the use of advanced generative models with simpler regression techniques for training a model predicting urban noise pollution levels near construction sites.",
    "label":"GenAI mentioned, not used"
  },
  {
    "text":"The research employed a rule-based expert system to diagnose problems with water distribution systems.",
    "label":"Not related to GenAI"
  },
  {
    "text":"We employ a CycleGAN to generate synthetic datasets mapping parking availability for training an AI-powered dynamic parking guidance system.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We developed a system using a large language model for real-time air quality monitoring report generation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper details the architecture of our city's open data portal.",
    "label":"Not related to GenAI"
  },
  {
    "text":"A generative AI model is used to optimize energy consumption patterns in smart buildings based on predicted occupancy.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The abstract mentions the potential of Variational Autoencoders (VAEs) for generating synthetic urban mobility data, but the work focuses primarily on statistical modeling of existing datasets.",
    "label":"GenAI mentioned, not used"
  }
]