[
  {
    "text":"This work presents a diffusion model-based method to simulate satellite imagery, enabling scenario simulation in urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study designed a method based on clustering to analyze sensor reports trends.",
    "label":"Not related"
  },
  {
    "text":"A graph attention network was used to forecast urban features, with no use of generative models like diffusion.",
    "label":"Not related"
  },
  {
    "text":"This study aims to integrate advanced language understanding and speech synthesis technologies to provide residents and visitors in smart cities with a more natural and interactive experience, ultimately contributing to the thriving development of smart cities in the consumer market.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used attention mechanism to classify energy trends.",
    "label":"Not related"
  },
  {
    "text":"A decision support system was developed to assist city planners in making informed decisions.",
    "label":"Not related"
  },
  {
    "text":"The abstract mentions the potential of VAEs for generating synthetic socio-economic data for urban areas, but relies on official census data.",
    "label":"Not related"
  },
  {
    "text":"While ChatGPT appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"To support smart energy grids, we developed a GAN-based system to predict peak energy consumption and simulate counterfactual demand-response strategies.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The proposed system employs a GAN to produce realistic crisis response scenarios, improving decisions in emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion covers the potential advantages and challenges of using large language models (LLMs) to generate synthetic textual descriptions corresponding to urban street sign images.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer model to generate personalized public transport recommendations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Recent tools such as ChatGPT show potential in NLP. However, we adopt traditional classification models for our citizen feedback analysis.",
    "label":"Not related"
  },
  {
    "text":"LLM was applied to synthesize waste generation data supporting emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a diffusion model-based method to synthesize air quality maps, enabling scenario simulation in emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a autoregressive model to synthesize pollution maps.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Our framework employs a transformer to generate code for automating specific urban data analysis pipelines.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A CycleGAN was implemented to generate energy consumption sequences for improving mobility optimization in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The system uses a CycleGAN to create sensor inputs used in infrastructure maintenance.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We use a conditional GAN to generate synthetic solar irradiance data for optimizing photovoltaic panel placement on city buildings.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The system uses a LLM to create scenario simulations used in transport regulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Although GPT is reviewed, this work uses a clustering algorithm for classify-based prediction.",
    "label":"Not related"
  },
  {
    "text":"The study utilized a genetic algorithm to optimize the routing of school buses.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on Kalman filters to analyze survey responses trends.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on Kalman filters to analyze utility usage trends.",
    "label":"Not related"
  },
  {
    "text":"We developed a system for automatically detecting and reporting graffiti using smartphone cameras.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on clustering to analyze sensor reports trends.",
    "label":"Not related"
  },
  {
    "text":"A transformer-based generative model is deployed to automatically generate concise natural language summaries of complex, multi-source urban sensor data streams for city officials.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative AI model is being used to optimize the placement of public charging stations for electric vehicles.",
    "label":"Not related"
  },
  {
    "text":"While generative approaches exist for network traffic simulation, this research relies on a discrete-event simulation model.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A recurrent neural network was used to segment address entities, with no use of generative models like LLM.",
    "label":"Not related"
  },
  {
    "text":"This paper explores the potential of GANs for generating realistic urban terrain data for flood modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study provides a comparative analysis, considering computational cost and accuracy, between generative models and physics-based models for urban noise propagation.",
    "label":"Not related"
  },
  {
    "text":"We implemented a large language model to create a multilingual chatbot for citizen inquiries about city services and regulations.",
    "label":"Not related"
  },
  {
    "text":"The abstract mentions the use of GANs for data augmentation, but the main research involves regression analysis.",
    "label":"Not related"
  },
  {
    "text":"We used a VAE to augment satellite images.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"While GPT appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"The proposed model incorporates positional encodings similar to those in Transformers, but it is a classification model for energy load forecasting.",
    "label":"Not related"
  },
  {
    "text":"An agent-based model was developed to simulate traffic flow, without using any generative deep learning components.",
    "label":"Not related"
  },
  {
    "text":"This study presents a LLM-based framework to augment building designs, which supports decision-making in environmental modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper explores the potential of GANs for generating plausible future land use scenarios based on planning constraints.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"In this study, a rule-based logic is employed to optimize load distributions in the context of infrastructure monitoring. While GAN models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"A diffusion model is trained and used to generate synthetic spatio-temporal data for improving models that predict urban air pollution hotspots.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The related work section discusses the historical use of generative adversarial networks (GANs) to generate synthetic architectural styles for training models that recognize urban building types and historical significance.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a nearest neighbor algorithm for identifying similar properties based on their location.",
    "label":"Not related"
  },
  {
    "text":"We implemented a large language model to create a multilingual chatbot for citizen inquiries about city services and regulations.",
    "label":"Not related"
  },
  {
    "text":"This work presents a GAN-based approach to simulate sensor coverage for crowd management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used decision tree to evaluate zoning compliance.",
    "label":"Not related"
  },
  {
    "text":"We implemented a regression analysis to model environmental fluctuations in commercial areas.",
    "label":"Not related"
  },
  {
    "text":"A clustering algorithm was used to identify areas with similar energy consumption profiles.",
    "label":"Not related"
  },
  {
    "text":"A generative transformer model was employed to simulate future urban heat patterns based on satellite imagery and meteorological data, aiming to assist city planners in mitigating heat islands.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study discusses the theoretical implications and ethical considerations of using generative models for smart city surveillance applications.",
    "label":"Not related"
  },
  {
    "text":"This study presents a autoregressive model-based framework to augment text summaries, which supports decision-making in smart city logistics.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Using GPT-4V, the system interprets site images and maintenance reports to identify deviations from approved construction plans in real-time, enhancing regulatory oversight in smart infrastructure development.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This report outlines how generative models could enhance urban digital twins, contrasting it with current non-generative methods.",
    "label":"Not related"
  },
  {
    "text":"The research employed a rule-based expert system to diagnose problems with energy transformers.",
    "label":"Not related"
  },
  {
    "text":"We used a diffusion model to simulate pollution maps.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a nearest neighbor algorithm for identifying similar buildings based on their characteristics.",
    "label":"Not related"
  },
  {
    "text":"We used rule-based logic to monitor address matches.",
    "label":"Not related"
  },
  {
    "text":"We developed a system using a large language model for real-time air quality monitoring report generation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a large language model, trained on public transport schedules and real-time updates, to generate conversational responses for a transit information bot.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative model, specifically a conditional GAN, is used to create synthetic thermal image data for training a model that detects energy inefficiencies in building facades.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study presents a LLM-based framework to simulate urban layouts, which supports decision-making in infrastructure monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The system uses a VAE to create training datasets used in smart grid operations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer-based sequence model to generate realistic urban traffic accident scenarios, detailing contributing factors, for advanced safety analysis and proactive prevention planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a autoregressive model to simulate satellite images.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A system was developed to manage building energy usage using decision trees, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"A transformer model is deployed to generate natural language summaries of complex urban sensor data streams for city officials.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study applies a clustering algorithm to detect address entities. While GAN models were discussed, they were not implemented.",
    "label":"Not related"
  },
  {
    "text":"A generative AI approach synthesizes realistic communication network load patterns under different urban event scenarios.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a diffusion model-based approach to simulate evacuation routes for resource distribution.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We developed a system using a large language model to generate automated responses to citizen inquiries about public transportation schedules.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This report outlines how generative models could enhance urban digital twins, contrasting it with current non-generative methods.",
    "label":"Not related"
  },
  {
    "text":"We used statistical model to classify zoning compliance.",
    "label":"Not related"
  },
  {
    "text":"The discussion covers the potential advantages and challenges of using large language models (LLMs) to generate synthetic textual descriptions corresponding to urban street sign images.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"To enhance sensor fault detection, a transformer model was trained using supervised learning without generative capabilities.",
    "label":"Not related"
  },
  {
    "text":"We are exploring the use of generative models to create synthetic datasets of pedestrian behavior in response to different urban design interventions.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Citizen feedback was collected via online surveys and analyzed using sentiment analysis tools based on dictionaries.",
    "label":"Not related"
  },
  {
    "text":"This study discusses the theoretical implications and ethical considerations of using generative models for smart city surveillance applications.",
    "label":"Not related"
  },
  {
    "text":"We used heuristics to evaluate load distributions.",
    "label":"Not related"
  },
  {
    "text":"A comparative study of different waste collection routing algorithms was conducted.",
    "label":"Not related"
  },
  {
    "text":"The research employed a rule-based expert system to diagnose problems with water distribution systems.",
    "label":"Not related"
  },
  {
    "text":"The literature review covers GANs for synthesizing urban textures, but our work focuses on texture analysis using convolutional neural networks.",
    "label":"Not related"
  },
  {
    "text":"The study used a regression model to analyze the relationship between energy prices and consumption patterns.",
    "label":"Not related"
  },
  {
    "text":"A cGAN is being used to generate synthetic satellite images for monitoring changes in urban green spaces.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study designed a method based on clustering to analyze traffic data trends.",
    "label":"Not related"
  },
  {
    "text":"A system was developed to manage traffic signal control using Kalman filters, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"We used a fine-tuned large language model (LLM) to generate realistic dialogue flows for a chatbot providing information about local urban events and cultural activities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A decision tree was used to match traffic anomalies, with no use of generative models like diffusion.",
    "label":"Not related"
  },
  {
    "text":"We applied a StyleGAN to create high-resolution maps detailing urban infrastructure vulnerabilities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The model generates synthetic air pollution maps using a VAE trained on historical sensor data.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We reviewed LLM-based solutions such as ChatGPT but opted for a symbolic rule-based approach for decision-making.",
    "label":"Not related"
  },
  {
    "text":"The proposed system employs a diffusion model to produce realistic satellite imagery, improving decisions in urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We built a system for automatically detecting and reporting broken sidewalks using image analysis.",
    "label":"Not related"
  },
  {
    "text":"Using a VAE, we created synthetic pedestrian flows to train robust systems for infrastructure monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a LLM-based method to produce traffic simulations, enabling scenario simulation in mobility management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A GAN architecture is implemented to generate synthetic datasets balancing rare event occurrences in smart city sensor networks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study designed a method based on decision trees to analyze traffic data trends.",
    "label":"Not related"
  },
  {
    "text":"A transformer model is deployed to generate natural language summaries of complex urban sensor data streams for city officials.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"diffusion model was applied to synthesize thermal profiles supporting land use analysis.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We utilize a diffusion-based method to generate realistic thermal profiles of city districts for energy planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A StyleGAN2 model generates highly realistic synthetic images of diverse road damage types (potholes, cracks, rutting) to augment limited training data for automated road maintenance inspection systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work applies rule-based logic to forecast load distributions in smart city systems. transformer is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"A VAE was trained to create synthetic text summaries across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world emergency management scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a conditional GAN (cGAN) framework to generate realistic spatio-temporal data for training models that predict short-term urban traffic congestion.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study designed a method based on clustering to analyze sensor reports trends.",
    "label":"Not related"
  },
  {
    "text":"The abstract mentions the use of GANs for data augmentation, but the main research involves regression analysis for traffic prediction.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on Kalman filters to analyze traffic data trends.",
    "label":"Not related"
  },
  {
    "text":"We implemented a rule-based systems to model urban sprawl in commercial areas.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on Kalman filters to analyze utility usage trends.",
    "label":"Not related"
  },
  {
    "text":"Using a ChatGPT, we created air quality maps to train robust systems for emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research discusses the application of LLMs in analyzing social media data for sentiment regarding urban planning, but implements a simpler keyword-based approach due to computational constraints.",
    "label":"Not related"
  },
  {
    "text":"We implemented a transformer model to generate personalized public transport recommendations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A system was developed to manage waste collection using clustering, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"The discussion presents the potential of diffusion models for training data augmentation specifically in the domain of smart transportation sensor data.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A cGAN is used to generate synthetic satellite images for urban expansion monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper discusses the feasibility of using diffusion models for simulating complex emergency evacuation scenarios in dense urban areas.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a diffusion model-based method to generate synthetic pedestrian flows, enabling scenario simulation in mobility management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A graph attention network was used to detect urban features, with no use of generative models like BERT.",
    "label":"Not related"
  },
  {
    "text":"We built a system for automatically classifying street signs using convolutional neural networks.",
    "label":"Not related"
  },
  {
    "text":"StyleGAN2 was applied to synthesize thermal profiles supporting emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The tool leverages LLMs to provide readable summaries of zoning laws for law students. It does not feed into city workflows.",
    "label":"Not related"
  },
  {
    "text":"In this paper, we propose a novel Generative Adversarial Network (GAN)-based framework for depth map super-resolution that is able to preserve the smooth areas, as well as the sharp edges at the boundaries of the depth map. Our proposed model is trained on two different modalities, namely color images and depth maps. However, at test time, our model only requires the depth map in order to produce a higher resolution version. We evaluated our model both quantitatively and qualitatively, and our experiments show that our method performs better than existing state-of-the-art models.",
    "label":"Not related"
  },
  {
    "text":"We built a system for automatically identifying and classifying different types of vehicles using image analysis.",
    "label":"Not related"
  },
  {
    "text":"Potential applications of generative models in facilitating participatory urban planning workshops are discussed, although the current platform relies on established survey and mapping tools.",
    "label":"Not related"
  },
  {
    "text":"The study utilized a hidden Markov model to analyze pedestrian behavior at crosswalks.",
    "label":"Not related"
  },
  {
    "text":"This work presents a VAE-based method to produce synthetic pedestrian flows, enabling scenario simulation in emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Generative AI is used to create synthetic datasets for training AI-powered waste management systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"rule-based systems was used to support optimization strategies in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"A transformer model is deployed to generate natural language summaries of complex urban sensor data streams for city officials.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Urban noise reports were translated into actionable noise source profiles using LLM summarization and classification, improving enforcement and acoustic zoning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a LLM-based approach to simulate evacuation routes for crowd management.",
    "label":"Not related"
  },
  {
    "text":"This study compares GANs with traditional statistical methods for generating synthetic data for urban population forecasting.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The abstract mentions the use of GANs for data augmentation, but the primary focus is on traditional time series analysis.",
    "label":"Not related"
  },
  {
    "text":"This paper presents a novel GAN-based approach for generating realistic urban street scenes, aiding in smart city simulation and planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model was employed to simulate post-earthquake structural risk across city zones. The synthetic outputs were used in resource allocation planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion presents the potential of diffusion models for augmenting sparse sensor readings in environmental monitoring networks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A StyleGAN2 model generates synthetic images of road damage (potholes, cracks) to augment training data for automated detection systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a clustering to model environmental fluctuations in commercial areas.",
    "label":"Not related"
  },
  {
    "text":"A GAN architecture is implemented to generate synthetic datasets balancing rare event occurrences in smart city sensor networks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study presents a autoregressive model-based framework to synthesize traffic flow scenarios, which supports decision-making in emergency management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a BERT to create synthetic traffic flow scenarios.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares the outputs of generative models (specifically GANs) with traditional econometric methods when generating synthetic data used to train models predicting urban housing price trends.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A LLM was used to create satellite imagery for emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A support vector machine (SVM) was used to predict the risk of earthquakes.",
    "label":"Not related"
  },
  {
    "text":"The study utilized a hidden Markov model to analyze pedestrian crossing behavior.",
    "label":"Not related"
  },
  {
    "text":"A rule-based system was used to detect energy loads, with no use of generative models like GAN.",
    "label":"Not related"
  },
  {
    "text":"We implemented a sequence-to-sequence transformer model to generate realistic future energy consumption data for individual smart buildings based on weather forecasts.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A support vector machine (SVM) was used to predict the risk of landslides.",
    "label":"Not related"
  },
  {
    "text":"The proposed system employs a ChatGPT to produce realistic crisis response scenarios, improving decisions in infrastructure monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study benchmarks the performance of various generative models (GANs, VAEs) against traditional machine learning techniques for urban mobility pattern analysis.",
    "label":"Not related"
  },
  {
    "text":"This project plan considered using generative models for scenario planning but opted for expert-driven workshops due to time constraints.",
    "label":"Not related"
  },
  {
    "text":"A autoregressive model was trained to create synthetic pollution maps across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world emergency management scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Generative AI is used to create synthetic datasets for training AI-powered waste management systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a diffusion model-based approach to simulate solar energy availability for policy planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This research explores the conceptual use of LLMs for generating diverse urban planning scenarios.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Kalman filters was used to support risk assessments in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"A LLM was used to produce traffic simulations for emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative AI agent-based model is used to create realistic simulations of pedestrian evacuation behavior in crowded urban subway stations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research employed a rule-based expert system to diagnose problems with building HVAC systems.",
    "label":"Not related"
  },
  {
    "text":"A statistical model was used to segment mobility trends, with no use of generative models like diffusion.",
    "label":"Not related"
  },
  {
    "text":"We leveraged a diffusion model to create synthetic LiDAR point clouds representing diverse urban environments for autonomous vehicle training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A rule-based system was used to evaluate traffic anomalies, with no use of generative models like GAN.",
    "label":"Not related"
  },
  {
    "text":"Although the term GAN appears in our keyword list, this study does not use generative models in any part of the methodology.",
    "label":"Not related"
  },
  {
    "text":"A autoregressive model was used to synthesize traffic simulations for emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The abstract mentions the potential of using GANs to create synthetic crime incident data for training predictive policing models, but ethical concerns led to using historical data only.",
    "label":"Not related"
  },
  {
    "text":"A transformer architecture is utilized to generate synthetic traffic flow data, including anomalies, for simulation purposes.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer-based sequence model to generate realistic urban traffic accident scenarios, including contributing factors, for safety analysis and prevention planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a conditional GAN (cGAN) framework to generate realistic spatio-temporal datasets for training deep learning models that predict short-term urban traffic congestion.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model is trained and used to generate synthetic spatio-temporal data for improving models that predict urban air pollution hotspots.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We reference ChatGPT in the related work section for its role in NLP, but our system uses traditional parsers for all data inputs.",
    "label":"Not related"
  },
  {
    "text":"In this study, a heuristics is employed to detect load distributions in the context of smart city logistics. While GAN models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"The introduction provides an overview of generative AI techniques, including VAEs and Flow-based models, applicable to smart city challenges.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study presents a diffusion model-based framework to simulate sensor data, which supports decision-making in environmental modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares GANs with statistical methods for traffic data generation, finding statistical methods more efficient for our specific use case.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A clustering algorithm was used to identify areas with similar socioeconomic characteristics.",
    "label":"Not related"
  },
  {
    "text":"We built a system for automatically detecting and reporting energy theft using machine learning.",
    "label":"Not related"
  },
  {
    "text":"The discussion presents the potential of diffusion models for training data augmentation in smart transportation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A StyleGAN2 was implemented to generate air quality patterns for improving disaster readiness in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We propose a multimodal architecture combining LLMs and spatial encoders to dynamically generate zoning recommendations in rapidly growing urban areas.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The literature review thoroughly covers GAN applications for synthesizing realistic urban material textures, but our work focuses on texture analysis using advanced convolutional neural networks (CNNs).",
    "label":"Not related"
  },
  {
    "text":"This research explores the conceptual use of LLMs for generating diverse urban planning scenarios.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used heuristics to detect load distributions.",
    "label":"Not related"
  },
  {
    "text":"This study presents a VAE-based framework to create synthetic satellite images, which supports decision-making in environmental modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used graph convolution to optimize environmental risks.",
    "label":"Not related"
  },
  {
    "text":"This study presents a ChatGPT-based framework to model sensor data, which supports decision-making in emergency management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion presents the potential of diffusion models for improving the accuracy of urban heat island predictions.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study critically compares the use of advanced generative models with simpler regression techniques for training a model predicting urban noise pollution levels near construction sites.",
    "label":"Not related"
  },
  {
    "text":"While diffusion appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"This paper discusses the feasibility of using diffusion models for emergency evacuation simulations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The effectiveness of different public health interventions during a simulated disease outbreak was evaluated using epidemiological models.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a StyleGAN2-based approach to simulate solar energy availability for policy planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"In this study, a statistical model is employed to forecast load distributions in the context of urban planning. While GAN models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on regression analysis to analyze utility usage trends.",
    "label":"Not related"
  },
  {
    "text":"A system was developed to manage waste collection using Kalman filters, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"A cGAN is employed to generate synthetic satellite images depicting various stages of urban expansion for monitoring land use change.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Generative AI is reshaping urban computing. In this paper, however, we focus on rule-based heuristics for pedestrian zone allocation.",
    "label":"Not related"
  },
  {
    "text":"A generative AI model is used to optimize energy consumption patterns in smart buildings based on predicted occupancy.",
    "label":"Not related"
  },
  {
    "text":"This paper proposes a data-driven approach to build a predictive and data-generative model to assess outdoor thermal comfort. The model benefits from the results of a study, which analyses Computational Fluid Dynamics (CFD) urban simulation to determine the thermal and wind comfort in Tallinn, Estonia. The ML model was built based on classification, and it uses an opaque ML model. The results were evaluated by applying different metrics and show us that the approach allows the implementation of a data-generative ML model to generate reliable data on outdoor comfort that can be used by urban stakeholders, planners, and researchers.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative flow-based model is used to create synthetic, high-fidelity data simulating urban pedestrian flow in complex intersections.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The proposed system employs a diffusion model to produce realistic urban layouts, improving decisions in urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A random forest model was trained to predict the risk of wildfires in urban-wildland interfaces.",
    "label":"Not related"
  },
  {
    "text":"The system uses a CycleGAN to create sensor inputs used in infrastructure maintenance.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used decision tree to analyze zoning compliance.",
    "label":"Not related"
  },
  {
    "text":"The discussion section covers the future potential of LLMs for generating interactive urban narratives and historical explorations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a diffusion model conditioned on temporal and spatial factors to generate realistic synthetic data streams for training a model predicting urban public transport ridership fluctuations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative model based on normalizing flows is employed to create synthetic household-level data for training models that predict urban waste generation rates.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares GANs with statistical methods for traffic data generation, finding statistical methods more efficient for our specific use case.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Predictive maintenance schedules for traffic signals were developed based on historical failure data and SVM classification.",
    "label":"Not related"
  },
  {
    "text":"We used rule-based logic to analyze energy trends.",
    "label":"Not related"
  },
  {
    "text":"We used a VAE to augment text summaries.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We deployed a network of IoT sensors to monitor noise levels across the downtown district.",
    "label":"Not related"
  },
  {
    "text":"A transformer was implemented to generate energy consumption sequences for improving disaster readiness in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The related work section discusses the increasing use of diffusion models to generate synthetic time-series data for training models predicting urban water consumption peaks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a GAN-based approach to simulate solar energy availability for resource distribution.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Although GPT is reviewed, this work uses a statistical model for recognize-based prediction.",
    "label":"Not related"
  },
  {
    "text":"We used a diffusion model conditioned on time and location to generate realistic synthetic data for training a model predicting urban public transport ridership fluctuations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a diffusion model conditioned on time and location to generate realistic synthetic data for training a model predicting urban public transport ridership fluctuations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion section speculates on using LLMs for generating explanations for AI-driven decisions in smart city contexts.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study explores the theoretical applications of VAEs in generating urban digital twins.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A cGAN is used to generate synthetic satellite images for urban expansion monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a VAE-based method to produce crisis response scenarios, enabling scenario simulation in emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A GAN was trained to augment pollution maps across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world urban planning scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We employ a CycleGAN to generate synthetic datasets mapping real-time parking availability images to occupancy grids, training an AI-powered dynamic parking guidance system.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A system was developed to manage building energy usage using regression analysis, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"This report outlines how generative models could enhance urban digital twins, contrasting it with current non-generative methods.",
    "label":"Not related"
  },
  {
    "text":"This study critically compares the use of advanced generative models with simpler regression techniques for training a model predicting urban noise pollution levels near construction sites.",
    "label":"Not related"
  },
  {
    "text":"A autoregressive model was used to synthesize urban layouts for emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"StyleGAN2 was applied to synthesize thermal profiles supporting land use analysis.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"decision trees was used to support risk assessments in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"A system was developed to manage waste collection using Kalman filters, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"We used decision tree to classify address matches.",
    "label":"Not related"
  },
  {
    "text":"A classification algorithm was used to identify areas at high risk of energy shortages.",
    "label":"Not related"
  },
  {
    "text":"A system was developed to manage citizen feedback using Kalman filters, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"This work presents a StyleGAN2-based approach to simulate sensor coverage for crowd management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"GANs are employed to generate interior design layouts for residential buildings. The system focuses on aesthetics and does not intersect with city-level planning.",
    "label":"Not related"
  },
  {
    "text":"The discussion section covers the future potential of LLMs for generating interactive urban narratives and historical explorations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We discuss the potential of LLMs for citizen feedback analysis, but focus on traditional statistical methods for this task.",
    "label":"Not related"
  },
  {
    "text":"This work applies rule-based logic to classify environmental risks in smart city systems. ChatGPT is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"Data from traffic cameras was processed using traditional computer vision techniques (edge detection, background subtraction) to estimate vehicle counts.",
    "label":"Not related"
  },
  {
    "text":"Using a GAN, we simulated traffic simulations to train robust systems for emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer model to generate personalized public transport recommendations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative AI model is used to optimize energy consumption patterns in smart buildings based on predicted occupancy.",
    "label":"Not related"
  },
  {
    "text":"A transformer architecture is utilized to generate synthetic traffic flow data, including rare anomaly events, for robust simulation model training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We developed a system for automatically monitoring air pollution levels using sensor networks.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on decision trees to analyze utility usage trends.",
    "label":"Not related"
  },
  {
    "text":"We discuss the potential of LLMs for citizen feedback analysis, but focus on traditional statistical methods for this task.",
    "label":"Not related"
  },
  {
    "text":"We implemented a system for automatically identifying and classifying different types of buildings using image analysis.",
    "label":"Not related"
  },
  {
    "text":"A LLM was implemented to generate air quality patterns for improving infrastructure development in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a regression analysis to model urban sprawl in city centers.",
    "label":"Not related"
  },
  {
    "text":"A ChatGPT was used to augment air quality maps for urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work applies decision tree to optimize traffic anomalies in smart city systems. BERT is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"This paper presents a novel GAN-based approach for generating realistic urban street scenes, aiding in smart city simulation and planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study presents a transformer-based framework to generate building designs, which supports decision-making in emergency management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"While transformer appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"GPT-4 was used to help translate policy documents into Spanish for internal use in a research team. There was no deployment in city systems.",
    "label":"Not related"
  },
  {
    "text":"A ChatGPT was used to augment satellite imagery for mobility management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We use a conditional GAN to generate synthetic, location-specific solar irradiance data for optimizing photovoltaic panel placement strategies on city building rooftops.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative model, specifically a conditional GAN, is used to create synthetic thermal image data for training a model that detects energy inefficiencies in building facades.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A classification algorithm was used to identify areas at high risk of flooding.",
    "label":"Not related"
  },
  {
    "text":"LLM was applied to synthesize urban noise layers supporting emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"An AI workshop explored using LLMs to brainstorm urban resilience strategies, but no models were deployed in practical tools.",
    "label":"Not related"
  },
  {
    "text":"We applied a StyleGAN to create high-resolution maps detailing urban infrastructure vulnerabilities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model was implemented to generate pedestrian trajectories for improving mobility optimization in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper explores the theoretical underpinnings of using GANs for generating plausible urban soundscapes for noise pollution studies.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a clustering to model transport behavior in commercial areas.",
    "label":"Not related"
  },
  {
    "text":"A neural network was used to optimize the scheduling of energy storage systems.",
    "label":"Not related"
  },
  {
    "text":"A support vector machine (SVM) was used to predict building energy consumption based on weather data.",
    "label":"Not related"
  },
  {
    "text":"This study compares the efficacy of generative models (specifically VAEs) with traditional statistical methods like MICE for urban data imputation tasks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A local municipality deployed a BERT-based summarizer fine-tuned on emergency transcripts to classify call urgency and recommend optimal dispatch locations, reducing response latency.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used graph convolution to classify energy trends.",
    "label":"Not related"
  },
  {
    "text":"We implemented a conditional GAN (cGAN) framework to generate realistic spatio-temporal data for training models that predict short-term urban traffic congestion.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Kalman filters was used to support risk assessments in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"The proposed system employs a GPT-style model to produce realistic synthetic pedestrian flows, improving decisions in infrastructure monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Using a LLM, we produced crisis response scenarios to train robust systems for urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A transformer was implemented to generate 3D building structures for improving environmental monitoring in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model is trained and used to generate synthetic spatio-temporal data for improving models that predict urban air pollution hotspots.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Our work focuses on texture analysis using convolutional neural networks.",
    "label":"Not related"
  },
  {
    "text":"A section introduces generative AI research in urban contexts, but the core model relies on hardcoded logic.",
    "label":"Not related"
  },
  {
    "text":"A conditional GAN (Pix2Pix) is implemented to generate synthetic images for training a model that automatically detects and categorizes urban graffiti.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A decision tree model was trained to predict the likelihood of power outages based on weather conditions.",
    "label":"Not related"
  },
  {
    "text":"The study utilized a genetic algorithm to optimize the placement of public transportation stops.",
    "label":"Not related"
  },
  {
    "text":"The system uses a VAE to create sensor inputs used in transport regulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer model based on user history to generate personalized recommendations for navigating urban green spaces and parks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study used time series analysis to forecast future energy production from renewable sources.",
    "label":"Not related"
  },
  {
    "text":"This work applies graph convolution to analyze energy trends in smart city systems. GAN is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"In this study, a decision tree is employed to analyze zoning compliance in the context of emergency management. While BERT models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"This paper presents a novel GAN-based approach for generating realistic urban street scenes, aiding in smart city simulation and planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research used time series analysis to forecast future water demand.",
    "label":"Not related"
  },
  {
    "text":"We implemented a transformer model to generate personalized public transport recommendations based on user travel history.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A conditional diffusion model is used to generate high-resolution images simulating urban damage scenarios for post-disaster response training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper presents a novel GAN-based approach for generating realistic urban street scenes, aiding in smart city simulation and planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion covers the potential challenges and benefits of using large language models to automatically generate metadata for urban datasets.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study applies a rule-based system to forecast address entities. While LLM models were discussed, they were not implemented.",
    "label":"Not related"
  },
  {
    "text":"This study investigates the theoretical benefits of using VAEs for dimensionality reduction of urban sensor data.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares the use of generative models (GANs) with traditional econometric methods for generating synthetic data to train models predicting urban housing price trends.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study explores the theoretical applications of VAEs in generating urban digital twins.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"In this study, a attention mechanism is employed to monitor zoning compliance in the context of infrastructure monitoring. While ChatGPT models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"This study analyzes the correlation between public transport availability and local economic activity using regression analysis.",
    "label":"Not related"
  },
  {
    "text":"A random forest model was trained to predict the likelihood of energy transformer failures.",
    "label":"Not related"
  },
  {
    "text":"In this study, a statistical model is employed to classify zoning compliance in the context of environmental modeling. While GAN models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"This work presents a diffusion model-based method to simulate traffic simulations, enabling scenario simulation in urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper uses the generative adversarial network (GAN) to explore the relationship between amenities distributions and urban morphology, thus effectively predicting and visualizing the ideal amenities distributions in fastgrowing cities based on the condition of well-developed megacities. In this research, we take Shanghai, one of the global cities in China with a big labour market, as the research sample. First, we use the Point of Interest (POI) data to draw the heatmap of urban amenities that support workersâ€™ daily life and collect the corresponding city maps. Then, we cut them into hundreds of image pairs as the training set and train a GAN model for predicting the future amenities distributions in other cities. To implement the model, we further collect the city maps of Jiaxing, one of the second-tier cities near Shanghai, as the testing set. Results show that our trained model can accurately predict amenities distributions for its future. The GAN-based prediction could effectively support detailed urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion presents the potential of diffusion models for training data augmentation in smart transportation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A autoregressive model was trained to simulate satellite images across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world environmental modeling scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a rule-based system for detecting anomalies in water consumption patterns.",
    "label":"Not related"
  },
  {
    "text":"Students applied a generative AI model to fictionalize urban futures in their architecture coursework.",
    "label":"Not related"
  },
  {
    "text":"decision trees was used to support risk assessments in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"A CNN-LSTM hybrid was used to match mobility trends, with no use of generative models like transformer.",
    "label":"Not related"
  },
  {
    "text":"This work presents a LLM-based method to produce satellite imagery, enabling scenario simulation in mobility management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a diffusion model to generate building designs.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a VAE to synthesize building designs.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A GAN architecture is implemented to generate synthetic datasets balancing rare event occurrences in smart city sensor networks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares the efficacy of generative models (specifically VAEs) with traditional statistical methods like MICE for urban data imputation tasks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative model based on normalizing flows is employed to create synthetic household-level data for training models that predict urban waste generation rates.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A GAN was used to synthesize crisis response scenarios for infrastructure monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Using a GAN, we created crisis response scenarios to train robust systems for mobility management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The paper explores the theoretical aspects of using variational autoencoders (VAEs) to generate synthetic point cloud data for recognizing urban building facade damages.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a LLM-based approach to simulate sensor coverage for crisis simulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a diffusion model-based method to produce urban noise data, enabling scenario simulation in emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Predictive maintenance schedules for traffic signals were developed based on historical failure data and SVM classification.",
    "label":"Not related"
  },
  {
    "text":"We implemented a nearest neighbor algorithm for identifying similar energy transformers based on their characteristics.",
    "label":"Not related"
  },
  {
    "text":"The research evaluates the impact of installing LED streetlights on energy consumption and public safety.",
    "label":"Not related"
  },
  {
    "text":"We implemented a decision trees to model transport behavior in residential zones.",
    "label":"Not related"
  },
  {
    "text":"A system was developed to manage citizen feedback using clustering, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"The system uses a LLM to create training datasets used in smart grid operations.",
    "label":"Not related"
  },
  {
    "text":"The paper focuses on traditional clustering algorithms for customer segmentation from smart meter data.",
    "label":"Not related"
  },
  {
    "text":"The proposed system employs a GAN to produce realistic air quality maps, improving decisions in emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"diffusion model was applied to synthesize thermal profiles supporting emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"In this study, a attention mechanism is employed to evaluate environmental risks in the context of environmental modeling. While GAN models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"This work presents a StyleGAN2-based approach to simulate pedestrian behavior for crisis simulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"In this study, a heuristics is employed to evaluate traffic anomalies in the context of emergency management. While ChatGPT models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"We use a transformer model to create realistic pedestrian movement datasets for crowd flow analysis.",
    "label":"Not related"
  },
  {
    "text":"The authors acknowledge the potential of diffusion models for inpainting missing sections in historical city maps, but employ manual restoration.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"While GPT appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"This work presents a StyleGAN2-based approach to simulate solar energy availability for crisis simulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We developed a system for automatically monitoring noise levels using sensor networks.",
    "label":"Not related"
  },
  {
    "text":"The research employed a rule-based expert system to optimize the operation of energy transformers.",
    "label":"Not related"
  },
  {
    "text":"We used a autoregressive model to synthesize text summaries.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The paper explores the feasibility of using generative AI (specifically GAN variants) to create synthetic image data for training models that recognize invasive urban plant species.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This research relies on a discrete-event simulation model for network traffic simulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion section covers the exciting future potential of large language models (LLMs) for generating interactive urban narratives and virtual historical explorations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative AI approach synthesizes realistic communication network load patterns under different urban event scenarios.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A GAN architecture is implemented to generate synthetic datasets balancing rare event occurrences in smart city sensor networks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A comparative study tested LLM performance in summarizing UN-Habitat reports but did not assess applicability in urban systems.",
    "label":"Not related"
  },
  {
    "text":"We used graph convolution to forecast environmental risks.",
    "label":"Not related"
  },
  {
    "text":"The proposed system employs a GAN to produce realistic synthetic pedestrian flows, improving decisions in infrastructure monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The proposed system employs a StyleGAN to produce realistic air quality maps, improving decisions in mobility management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study designed a method based on regression analysis to analyze utility usage trends.",
    "label":"Not related"
  },
  {
    "text":"This work presents a transformer-based approach to simulate sensor coverage for crowd management.",
    "label":"Not related"
  },
  {
    "text":"In this study, a rule-based logic is employed to forecast zoning compliance in the context of emergency management. While LLM models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"This paper explores the theoretical underpinnings of using GANs for generating plausible urban soundscapes for noise pollution studies.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Our system utilizes LLMs to auto-generate citizen-friendly summaries of urban policy documents, enhancing participatory governance in smart city contexts.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study applies a decision tree to recognize urban features. While GAN models were discussed, they were not implemented.",
    "label":"Not related"
  },
  {
    "text":"This study compares the use of generative models (GANs) with traditional econometric methods for generating synthetic data to train models predicting urban housing price trends.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work applies rule-based logic to detect energy trends in smart city systems. BERT is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"The system uses a GAN to create sensor inputs used in smart grid operations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study designed a method based on regression analysis to analyze traffic data trends.",
    "label":"Not related"
  },
  {
    "text":"This study analyzes the correlation between public transport availability and local economic activity using regression analysis.",
    "label":"Not related"
  },
  {
    "text":"diffusion model was applied to synthesize urban noise layers supporting energy planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a LLM-based approach to simulate sensor coverage for crisis simulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares the efficacy of generative models (specifically VAEs) with traditional statistical methods like MICE for data imputation tasks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We utilize a generative adversarial network (WGAN-GP) to create synthetic sensor readings for training a predictive maintenance model for water pipeline infrastructure.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A system was developed to manage waste collection using regression analysis, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"The emergency planning module uses a diffusion model to generate synthetic pedestrian flows under various hazard conditions.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Fine-tuned LLMs were integrated with mobility platforms to detect anomalies in public bus operations and automatically generate performance reports for fleet managers.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a VAE-based approach to simulate sensor coverage for crisis simulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We built a system for automatically detecting and reporting energy waste using machine learning.",
    "label":"Not related"
  },
  {
    "text":"We used a CNN to detect traffic anomalies; diffusion models were only briefly explored in background research.",
    "label":"Not related"
  },
  {
    "text":"We used statistical model to detect zoning compliance.",
    "label":"Not related"
  },
  {
    "text":"The paper mentions the use of Variational Autoencoders for anomaly detection in water distribution networks, but focuses on traditional pressure sensors.",
    "label":"Not related"
  },
  {
    "text":"The discussion covers the potential advantages and challenges of using large language models (LLMs) to generate synthetic textual descriptions corresponding to urban street sign images.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study designed a method based on clustering to analyze survey responses trends.",
    "label":"Not related"
  },
  {
    "text":"A CNN-LSTM hybrid was used to recognize energy loads, with no use of generative models like LLM.",
    "label":"Not related"
  },
  {
    "text":"This study presents a transformer-based framework to synthesize text summaries, which supports decision-making in smart city logistics.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The effectiveness of different public health interventions during a simulated disease outbreak was evaluated using epidemiological models.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study explores the applications of variational autoencoders (VAEs) in generating urban digital twins.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a Kalman filter to improve the accuracy of energy consumption forecasts.",
    "label":"Not related"
  },
  {
    "text":"We built a system for automatically detecting and reporting potholes using smartphone sensors.",
    "label":"Not related"
  },
  {
    "text":"A GAN was implemented to generate 3D building structures for improving mobility optimization in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"regression analysis was used to support monitoring systems in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"We implemented a sequence-to-sequence transformer model to generate realistic future energy consumption data for individual smart buildings based on weather forecasts.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a CycleGAN-based approach to simulate evacuation routes for resource distribution.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model is trained and used to generate synthetic spatio-temporal data for improving models that predict urban air pollution hotspots.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The proposed model incorporates positional encodings similar to those in Transformers, but it is a classification model for energy load forecasting.",
    "label":"Not related"
  },
  {
    "text":"We implemented a clustering to model transport behavior in residential zones.",
    "label":"Not related"
  },
  {
    "text":"This study compares Generative Adversarial Networks with statistical time-series methods for forecasting short-term public transit demand.",
    "label":"Not related"
  },
  {
    "text":"We implemented a large language model fine-tuned on city data to create a chatbot answering citizen inquiries about local regulations and services.",
    "label":"Not related"
  },
  {
    "text":"This study discusses the theoretical implications and ethical considerations surrounding the use of generative models for smart city surveillance applications.",
    "label":"Not related"
  },
  {
    "text":"We utilize a generative adversarial network (WGAN-GP) to create synthetic sensor readings for training a predictive maintenance model for water pipeline infrastructure.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Our framework employs a transformer to generate code for automating specific urban data analysis pipelines.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"While our current pipeline uses CNNs for surveillance image detection, future iterations might explore GenAI tools like Stable Diffusion or GPT-4.",
    "label":"Not related"
  },
  {
    "text":"A conditional diffusion model is used to generate high-resolution images simulating urban damage scenarios for post-disaster response training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Using a autoregressive model, we generated urban layouts to train robust systems for mobility management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A cGAN is used to generate synthetic satellite images for urban expansion monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work applies statistical model to monitor address matches in smart city systems. ChatGPT is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"The presentation touched upon using VAEs for anomaly detection in smart grids, but the deployed solution uses isolation forests.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a sequence-to-sequence transformer model to generate realistic future energy consumption profiles for individual smart buildings based on weather forecasts and user behavior patterns.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research used time series analysis to forecast future crime trends.",
    "label":"Not related"
  },
  {
    "text":"We fine-tuned a transformer-based LLM to generate hazard response plans for different urban zones.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"GAN was applied to synthesize urban noise layers supporting land use analysis.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer model based on user history to generate personalized recommendations for navigating urban green spaces and parks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used Claude 2 to summarize decades of urban development literature to support graduate teaching materials.",
    "label":"Not related"
  },
  {
    "text":"The abstract mentions the potential of Variational Autoencoders (VAEs) for generating synthetic urban mobility data, but the work focuses primarily on statistical modeling of existing datasets.",
    "label":"Not related"
  },
  {
    "text":"We use a sequence-to-sequence transformer model to create realistic pedestrian trajectory datasets mimicking movement in public squares.",
    "label":"Not related"
  },
  {
    "text":"We used graph convolution to evaluate environmental risks.",
    "label":"Not related"
  },
  {
    "text":"We developed a system using a large language model for real-time air quality monitoring report generation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The authors employ manual restoration for inpainting missing sections in historical city maps.",
    "label":"Not related"
  },
  {
    "text":"We use a conditional GAN to generate synthetic solar irradiance data for optimizing photovoltaic panel placement on city buildings.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The related work section discusses the use of diffusion models for generating high-fidelity 3D city models, contrasting them with procedural modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The proposed system employs a StyleGAN to produce realistic urban layouts, improving decisions in urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study applies a statistical model to match traffic anomalies. While transformer models were discussed, they were not implemented.",
    "label":"Not related"
  },
  {
    "text":"While GAN appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"A conditional GAN (Pix2Pix style) is implemented to generate synthetic paired images for training a model that automatically detects and categorizes different types of urban graffiti.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We applied a StyleGAN to create high-resolution maps detailing urban infrastructure vulnerabilities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"While LLM appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"A system was developed to manage waste collection using regression analysis, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"The study applies a decision tree to segment urban features. While diffusion models were discussed, they were not implemented.",
    "label":"Not related"
  },
  {
    "text":"Using a VAE, we created synthetic building layouts to test urban planning algorithms under varying density constraints.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This report outlines how generative models, such as VAEs and GANs, could significantly enhance the dynamism of urban digital twins, contrasting this potential with current static, non-generative methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A transformer was implemented to generate air quality patterns for improving disaster readiness in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study discusses the theoretical implications and ethical considerations of using generative models for smart city surveillance applications.",
    "label":"Not related"
  },
  {
    "text":"The abstract focuses on statistical modeling of existing ride-sharing datasets.",
    "label":"Not related"
  },
  {
    "text":"Although LLM is reviewed, this work uses a recurrent neural network for classify-based prediction.",
    "label":"Not related"
  },
  {
    "text":"The research used association rule mining to identify patterns in energy consumption.",
    "label":"Not related"
  },
  {
    "text":"The introduction provides an overview of generative AI techniques, including transformers and GANs, relevant to smart cities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We leveraged a diffusion model to create diverse synthetic LiDAR point clouds representing complex urban environments, significantly augmenting data for autonomous vehicle perception system training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We reviewed LLM-based solutions such as ChatGPT but opted for a symbolic rule-based approach for decision-making.",
    "label":"Not related"
  },
  {
    "text":"While GPT appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"The related work section discusses the historical use of GANs to generate synthetic architectural styles for training models that recognize urban building types and functions.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study employed a genetic algorithm to optimize the placement of public Wi-Fi hotspots.",
    "label":"Not related"
  },
  {
    "text":"A transformer architecture is utilized to generate synthetic traffic flow data, including anomalies, for simulation purposes.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The city council approved new zoning regulations aimed at increasing green space.",
    "label":"Not related"
  },
  {
    "text":"We apply generative AI to develop personalized learning paths for students in virtual classrooms. Although innovative, the system is unrelated to urban development.",
    "label":"Not related"
  },
  {
    "text":"A recurrent neural network was used to segment mobility trends, with no use of generative models like GAN.",
    "label":"Not related"
  },
  {
    "text":"While GPT appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"The related work section covers the use of generative models for data synthesis in urban contexts.",
    "label":"Not related"
  },
  {
    "text":"This report outlines how generative models could enhance urban digital twins, contrasting it with current non-generative methods.",
    "label":"Not related"
  },
  {
    "text":"The system uses a LLM to create training datasets used in transport regulation.",
    "label":"Not related"
  },
  {
    "text":"The related work section discusses the historical use of GANs to generate synthetic architectural styles for training models that recognize urban building types and functions.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The abstract mentions the potential of using GANs to create synthetic crime incident data for training predictive policing models.",
    "label":"Not related"
  },
  {
    "text":"The proposed system employs a LLM to produce realistic urban noise data, improving decisions in urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The abstract mentions the possibility of using generative AI to create synthetic image variations (e.g., different weather, lighting, partial occlusion) for training robust models that recognize urban traffic light states.",
    "label":"Not related"
  },
  {
    "text":"This work presents a diffusion model-based method to produce synthetic pedestrian flows, enabling scenario simulation in emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer-based generative model using user history to generate personalized recommendations for navigating urban green spaces and accessing park amenities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a GAN-based approach to simulate urban growth for crisis simulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A recurrent neural network was used to classify traffic anomalies, with no use of generative models like GAN.",
    "label":"Not related"
  },
  {
    "text":"A system was developed to manage building energy usage using rule-based systems, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"The study applies a recurrent neural network to forecast traffic anomalies. While GPT models were discussed, they were not implemented.",
    "label":"Not related"
  },
  {
    "text":"Using a diffusion model, we augmentd urban noise data to train robust systems for infrastructure monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A GAN was used to create air quality maps for infrastructure monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Although transformer is reviewed, this work uses a rule-based system for evaluate-based prediction.",
    "label":"Not related"
  },
  {
    "text":"The abstract mentions the use of GANs for data augmentation, but the main research involves regression analysis.",
    "label":"Not related"
  },
  {
    "text":"This work applies attention mechanism to evaluate load distributions in smart city systems. LLM is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"A diffusion model is being developed to generate realistic simulations of floodwater propagation in urban areas.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A GAN was trained to synthesize traffic flow scenarios across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world emergency management scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A transformer model is deployed to generate natural language summaries of complex urban sensor data streams for city officials.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper explores the potential of generative adversarial networks (GANs) for generating realistic urban terrain data suitable for detailed flood risk modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used decision tree to detect load distributions.",
    "label":"Not related"
  },
  {
    "text":"GPT-3 is listed among candidate models, but we ultimately rely on a decision-tree classifier trained on survey text.",
    "label":"Not related"
  },
  {
    "text":"We implemented a rule-based systems to model energy patterns in city centers.",
    "label":"Not related"
  },
  {
    "text":"This study presents a ChatGPT-based framework to simulate pollution maps, which supports decision-making in smart city logistics.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"In this study, a decision tree is employed to analyze zoning compliance in the context of urban planning. While GAN models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"A autoregressive model was trained to generate building designs across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world infrastructure monitoring scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares the effectiveness of generative models versus traditional statistical methods for imputing missing values in urban traffic sensor data.",
    "label":"Not related"
  },
  {
    "text":"The research discusses the application of LLMs in analyzing social media data for sentiment regarding urban planning, but implements a simpler keyword-based approach due to computational constraints.",
    "label":"Not related"
  },
  {
    "text":"The related work section covers the use of generative models for creating synthetic data for urban noise mapping.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative AI approach synthesizes realistic communication network load patterns under different urban event scenarios.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Although transformer is reviewed, this work uses a rule-based system for evaluate-based prediction.",
    "label":"Not related"
  },
  {
    "text":"This paper explores the potential of GANs for generating realistic urban terrain data for flood modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Using a ChatGPT, we generated crisis response scenarios to train robust systems for emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Generative AI is used to create synthetic datasets for training AI-powered waste management sorting systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The proposed system employs a LLM to produce realistic satellite imagery, improving decisions in emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The literature review covers GANs for synthesizing urban textures, but our work focuses on texture analysis using convolutional neural networks.",
    "label":"Not related"
  },
  {
    "text":"The system uses a GAN to create scenario simulations used in transport regulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study utilized a time series forecasting model to predict future crime rates.",
    "label":"Not related"
  },
  {
    "text":"This thesis explores the concept of using large language models (LLMs) to generate fictional, yet demographically realistic, resident personas for simulating diverse service demands, but does not include an implementation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a system for automatically identifying and classifying different types of trees using image analysis.",
    "label":"Not related"
  },
  {
    "text":"This work presents a diffusion model-based approach to simulate sensor coverage for resource distribution.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The city council approved new zoning regulations aimed at increasing green space.",
    "label":"Not related"
  },
  {
    "text":"While GAN appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"This study benchmarks the performance of various generative models (including GANs and VAEs) against traditional machine learning techniques for urban mobility pattern analysis.",
    "label":"Not related"
  },
  {
    "text":"We used attention mechanism to optimize address matches.",
    "label":"Not related"
  },
  {
    "text":"We used decision tree to classify zoning compliance.",
    "label":"Not related"
  },
  {
    "text":"The system uses a VAE to create sensor inputs used in transport regulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Generative AI is being used to create synthetic datasets for training AI-powered systems to optimize traffic signal timing.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We use a generative model to produce synthetic datasets for training flood prediction systems, although it is not deployed directly in any smart city infrastructure.",
    "label":"Not related"
  },
  {
    "text":"We implemented a clustering to model urban sprawl in city centers.",
    "label":"Not related"
  },
  {
    "text":"This work applies graph convolution to forecast load distributions in smart city systems. transformer is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"A generative model is employed to create synthetic data representing patterns of illegal waste dumping detected via aerial imagery.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a VAE-based approach to simulate evacuation routes for crisis simulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work applies heuristics to optimize environmental risks in smart city systems. BERT is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"This study critically compares the use of advanced generative models with simpler regression techniques for training a model predicting urban noise pollution levels near construction sites.",
    "label":"Not related"
  },
  {
    "text":"Generative neural networks were used to visualize crowd behavior in stadiums for safety simulations. While applicable to smart city domains, it remains experimental.",
    "label":"Not related"
  },
  {
    "text":"This work represents a continuation of research regarding the automatic optimization of building geometries in photogrammetric DSMs with half-meter resolution and introduces an improved generative adversarial network (GAN) architecture which allows to reconstruct complete and detailed building structures without neglecting even low-rise urban constructions. The generative part of the network is constructed in a way that it simultaneously processes height and intensity information, and combines short and long skip connections within one architecture. To improve different aspects of the surface, several loss terms are used, the contributions of which are automatically balanced during training. The obtained results demonstrate that the proposed methodology can achieve two goals without any manual intervention: improve the roof surfaces by making them more planar and also recognize and optimize even small residential buildings which are hard to detect.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study designed a method based on regression analysis to analyze utility usage trends.",
    "label":"Not related"
  },
  {
    "text":"We implemented a clustering to model transport behavior in residential zones.",
    "label":"Not related"
  },
  {
    "text":"We implemented a transformer model to generate sequences representing building energy consumption based on weather and occupancy inputs.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative AI model, specifically StyleGAN, is used to optimize the visual design of public spaces for improved walkability.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A system was developed to manage traffic signal control using decision trees, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"A random forest model was trained to predict the likelihood of water main breaks.",
    "label":"Not related"
  },
  {
    "text":"The related work section discusses the increasing use of diffusion models to generate synthetic time-series data for training models predicting urban water consumption peaks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study presents a ChatGPT-based framework to simulate traffic flow scenarios, which supports decision-making in environmental modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The model generates synthetic music samples based on user preferences. This has no current linkage with smart city applications.",
    "label":"Not related"
  },
  {
    "text":"The research discusses the use of LLMs in analyzing transcripts from city council meetings, but implements a simpler topic modeling approach.",
    "label":"Not related"
  },
  {
    "text":"This work presents a LLM-based method to augment satellite imagery, enabling scenario simulation in mobility management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The related work section covers the use of various generative models for data synthesis in urban contexts, including VAEs and GANs.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative model was deployed to extract features from aerial scans of underground cable routes, improving safety inspections and maintenance prioritization across a large-scale urban grid.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper discusses the feasibility of using diffusion models for emergency evacuation simulations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model was used to synthesize crisis response scenarios for urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study applies a recurrent neural network to classify energy loads. While GAN models were discussed, they were not implemented.",
    "label":"Not related"
  },
  {
    "text":"While GPT appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"A StyleGAN2 was implemented to generate pedestrian trajectories for improving environmental monitoring in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We applied a StyleGAN architecture to create high-resolution maps detailing urban infrastructure vulnerabilities under simulated stress conditions.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model is used to create synthetic sensor data for training an anomaly detection system in smart grids.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study applies a clustering algorithm to detect energy loads. While BERT models were discussed, they were not implemented.",
    "label":"Not related"
  },
  {
    "text":"A neural network was used to predict the demand for emergency services.",
    "label":"Not related"
  },
  {
    "text":"A clustering algorithm was used to identify areas with similar housing prices.",
    "label":"Not related"
  },
  {
    "text":"rule-based systems was used to support policy design in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"A StyleGAN2 model generates synthetic images of road damage (potholes, cracks) to augment training data for automated detection systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A system was developed to manage citizen feedback using Kalman filters, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"We implemented a sequence-to-sequence transformer model to generate realistic future energy consumption data for individual smart buildings based on weather forecasts.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The related work section discusses the historical use of GANs to generate synthetic architectural styles for training models that recognize urban building types and functions.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We use a transformer model to create realistic pedestrian movement datasets for crowd flow analysis.",
    "label":"Not related"
  },
  {
    "text":"A transformer-based generative model is used to synthesize realistic traffic flow data under different weather conditions for simulation robustness testing.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a system for automatically detecting and reporting water leaks using sensor data.",
    "label":"Not related"
  },
  {
    "text":"This study presents a transformer-based framework to simulate sensor data, which supports decision-making in environmental modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"regression analysis was used to support monitoring systems in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"This project plan considered using generative models for scenario planning but opted for expert-driven workshops due to time constraints.",
    "label":"Not related"
  },
  {
    "text":"The system uses a CycleGAN to create scenario simulations used in transport regulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Although LLM is reviewed, this work uses a CNN-LSTM hybrid for classify-based prediction.",
    "label":"Not related"
  },
  {
    "text":"Our system utilizes a variational autoencoder (VAE) to generate multiple plausible future land use scenarios based on current urban trends and proposed planning constraints.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a conditional GAN (cGAN) framework to generate realistic spatio-temporal data for training models that predict short-term urban traffic congestion.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"In this study, we propose a novel imitation learning framework tailored for language-conditioned robotic tasks. Our framework includes specialized encoders designed for various benchmarks and utilizes two distinct models: the Transformer and Diffusion models. We rigorously evaluate this framework in three different robotic environments. Our findings indicate that the framework consistently delivers superior performance across multiple domains. Notably, we observe that the Transformer model is particularly effective in managing tasks with long trajectories, whereas the Diffusion model demonstrates enhanced proficiency in generating trajectories from limited training datasets. Our approach showcases remarkable generalization capabilities across a range of tasks and achieves significantly higher success rates in task completion.",
    "label":"Not related"
  },
  {
    "text":"We implemented a sequence-to-sequence transformer model to generate realistic future energy consumption data for individual smart buildings based on weather forecasts.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a CycleGAN-based approach to simulate pedestrian behavior for crisis simulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The paper uses variational autoencoders (VAEs) to generate synthetic point cloud data for recognizing subtle damage patterns on urban building facades.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study utilized a genetic algorithm to optimize the routing of emergency vehicles.",
    "label":"Not related"
  },
  {
    "text":"This study compares GANs with statistical methods for traffic data generation, finding statistical methods more efficient for our specific low-latency use case.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"While our literature review included diffusion models and LLMs, the model we developed is based entirely on decision trees and rule-based logic.",
    "label":"Not related"
  },
  {
    "text":"The study applies a recurrent neural network to classify traffic anomalies. While BERT models were discussed, they were not implemented.",
    "label":"Not related"
  },
  {
    "text":"The paper mentions the use of VAEs for feature learning from sensor data, but focuses on traditional clustering algorithms.",
    "label":"Not related"
  },
  {
    "text":"Using a LLM, we created training datasets to train robust systems for emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The system uses a VAE to create sensor inputs used in infrastructure maintenance.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work applies decision tree to classify energy trends in smart city systems. transformer is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"This thesis explores the concept of using LLMs to generate fictional resident personas for simulating service demands, but does not implement it.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We use a transformer-based generative model to create realistic pedestrian movement datasets for urban crowd flow analysis and prediction.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on decision trees to analyze traffic data trends.",
    "label":"Not related"
  },
  {
    "text":"The paper explores the theoretical aspects of using variational autoencoders (VAEs) to generate synthetic point cloud data for recognizing urban building facade damages.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The paper explores the feasibility of using generative AI (specifically GANs) to create synthetic image data for training a model that recognizes invasive urban plant species.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a transformer-based approach to simulate solar energy availability for resource distribution.",
    "label":"Not related"
  },
  {
    "text":"Potential applications of generative models in participatory urban planning are discussed, although the current platform uses traditional survey methods.",
    "label":"Not related"
  },
  {
    "text":"The related work section discusses the increasing use of diffusion models to generate synthetic time-series data for training models predicting urban water consumption peaks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a GAN to generate traffic flow scenarios.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used principal component analysis (PCA) to reduce the dimensionality of sensor data before clustering.",
    "label":"Not related"
  },
  {
    "text":"rule-based systems was used to support monitoring systems in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"We employ a CycleGAN to generate synthetic datasets mapping parking availability for training an AI-powered dynamic parking guidance system.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"GAN was applied to synthesize urban noise layers supporting energy planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A rule-based system was developed to optimize the operation of the city's power grid.",
    "label":"Not related"
  },
  {
    "text":"The abstract mentions the potential of using generative adversarial networks (GANs) to create synthetic crime incident data for training predictive policing models.",
    "label":"Not related"
  },
  {
    "text":"A diffusion model was employed to simulate post-earthquake structural risk across city zones. The synthetic outputs were used in resource allocation planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The paper mentions the use of VAEs for feature learning from sensor data, but focuses on traditional clustering algorithms.",
    "label":"Not related"
  },
  {
    "text":"Kalman filters was used to support optimization strategies in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"This work presents a CycleGAN-based approach to simulate sensor coverage for crisis simulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A graph attention model is used to match address segments hierarchically. The model is compared to LLMs but does not generate any content.",
    "label":"Not related"
  },
  {
    "text":"A graph-based framework was evaluated alongside generative methods like GANs, but our final approach is non-generative.",
    "label":"Not related"
  },
  {
    "text":"A generative AI model is actively used to create realistic simulations of crowd behavior during large public events for safety planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"While LLM appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"The study reviews generative techniques for simulating urban growth, but adopts an agent-based modeling approach for the final implementation.",
    "label":"Not related"
  },
  {
    "text":"The research employed a rule-based expert system to diagnose problems with traffic signals.",
    "label":"Not related"
  },
  {
    "text":"We developed a system for automatically identifying potholes using image processing techniques.",
    "label":"Not related"
  },
  {
    "text":"Although GPT is reviewed, this work uses a graph attention network for detect-based prediction.",
    "label":"Not related"
  },
  {
    "text":"The study reviews generative techniques for simulating urban growth, but adopts an agent-based modeling approach for the final implementation.",
    "label":"Not related"
  },
  {
    "text":"The paper explores the feasibility of using generative AI (specifically GANs) to create synthetic image data for training a model that recognizes invasive urban plant species.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A BERT was trained to create synthetic satellite images across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world infrastructure monitoring scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The paper explores the feasibility of using generative AI (specifically GANs) to create synthetic image data for training a model that recognizes invasive plant species.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a GAN to generate text summaries.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A clustering algorithm was used to identify areas with similar energy efficiency levels.",
    "label":"Not related"
  },
  {
    "text":"We applied a StyleGAN to create high-resolution maps detailing urban infrastructure vulnerabilities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a fine-tuned large language model (LLM) to generate realistic dialogue flows for a chatbot providing information about local urban events and cultural activities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This research explores the conceptual use of LLMs for generating diverse scenarios for urban resilience planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The system uses a GAN to create annotated maps used in infrastructure maintenance.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work applies statistical model to classify load distributions in smart city systems. LLM is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"Kalman filters was used to support monitoring systems in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"This paper presents a novel GAN-based approach for generating realistic urban street scenes, aiding in smart city simulation and planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A decision support system was developed to assist energy consumers in making informed decisions.",
    "label":"Not related"
  },
  {
    "text":"A generative flow-based model is used to create synthetic, high-fidelity data simulating urban pedestrian flow in complex intersections.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Although the term GAN appears in our keyword list, this study does not use generative models in any part of the methodology.",
    "label":"Not related"
  },
  {
    "text":"We used heuristics to monitor environmental risks.",
    "label":"Not related"
  },
  {
    "text":"Our framework employs a transformer to generate code for automating specific urban data analysis pipelines.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We leveraged a diffusion model to create synthetic LiDAR point clouds representing diverse urban environments for autonomous vehicle training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A GAN was trained to synthesize sensor data across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world urban planning scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Kalman filters was used to support policy design in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"Linear programming was used to optimize the allocation of emergency response vehicles.",
    "label":"Not related"
  },
  {
    "text":"An LLM was included in the comparison table but not in the experimental pipeline or results.",
    "label":"Not related"
  },
  {
    "text":"A BERT was trained to model urban layouts across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world urban planning scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"decision trees was used to support optimization strategies in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"The related work section discusses the historical use of GANs to generate synthetic architectural styles for training models that recognize urban building types and functions.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative AI agent-based model is used to create realistic simulations of pedestrian evacuation behavior in crowded urban subway stations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We trained an LLM to generate summaries of public council meetings related to smart city initiatives.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A conditional diffusion model is used to generate high-resolution images simulating urban damage scenarios for post-disaster response training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study utilized a hidden Markov model to analyze the behavior of energy storage systems.",
    "label":"Not related"
  },
  {
    "text":"We used attention mechanism to analyze energy trends.",
    "label":"Not related"
  },
  {
    "text":"Smart cities are increasingly adopting AI tools. Models like GPT-4 and LLaMA have seen rising attention, though our work focuses on rule-based air quality inference.",
    "label":"Not related"
  },
  {
    "text":"While various generative approaches exist for network traffic simulation, this research relies on a well-established discrete-event simulation model for performance evaluation.",
    "label":"Not related"
  },
  {
    "text":"This work presents a StyleGAN2-based approach to simulate pedestrian behavior for resource distribution.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A conditional GAN (Pix2Pix) is implemented to generate synthetic images for training a model that automatically detects and categorizes urban graffiti.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study explores the theoretical applications of VAEs in generating urban digital twins.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A LLM was implemented to generate pedestrian trajectories for improving disaster readiness in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We built a system for automatically detecting and classifying energy usage anomalies using machine learning.",
    "label":"Not related"
  },
  {
    "text":"The related work section discusses the increasing use of diffusion models to generate synthetic time-series data for training models predicting urban water consumption peaks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"regression analysis was used to support monitoring systems in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"A conditional generative adversarial network (cGAN) is used to generate synthetic satellite images for precise urban expansion monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research discusses the application of large language models (LLMs) in analyzing social media sentiment regarding urban planning initiatives.",
    "label":"Not related"
  },
  {
    "text":"A decision support system was developed to assist energy grid operators in making informed decisions.",
    "label":"Not related"
  },
  {
    "text":"The introduction provides an overview of generative AI techniques, including transformers and GANs, relevant to smart cities.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"In this study, a statistical model is employed to evaluate address matches in the context of smart city logistics. While transformer models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"The abstract mentions the possibility of using generative AI to create synthetic image variations for training a model that recognizes different states of urban traffic lights (e.g., occluded, varying weather).",
    "label":"Not related"
  },
  {
    "text":"The discussion section covers the future potential of LLMs for generating interactive urban narratives and historical explorations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a regression analysis to model energy patterns in city centers.",
    "label":"Not related"
  },
  {
    "text":"The proposed system employs a ChatGPT to produce realistic satellite imagery, improving decisions in emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We utilize a generative adversarial network (WGAN-GP) to create synthetic sensor readings for training a predictive maintenance model for water pipeline infrastructure.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The introduction provides an overview of generative AI techniques, including transformer-based generative models and generative adversarial networks (GANs), relevant to smart city challenges.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"VAE was applied to synthesize thermal profiles supporting emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a transformer to generate urban layouts.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The emergency planning module uses a diffusion model to generate synthetic pedestrian flows under various hazard conditions.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a rule-based systems to model urban sprawl in city centers.",
    "label":"Not related"
  },
  {
    "text":"In this study, a rule-based logic is employed to detect environmental risks in the context of urban planning. While LLM models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"We built a system for automatically detecting and reporting damaged streetlights using image analysis.",
    "label":"Not related"
  },
  {
    "text":"A conditional GAN is specifically trained and used to generate synthetic images of various urban graffiti styles for detection algorithm training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The system uses a CycleGAN to create sensor inputs used in transport regulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This thesis explores the concept of using LLMs to generate fictional resident personas for simulating service demands, but does not implement it.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A conditional GAN is employed to create synthetic thermal image data, augmenting the training set for a model detecting energy inefficiencies in building facades.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"clustering was used to support optimization strategies in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"This study presents a autoregressive model-based framework to simulate sensor data, which supports decision-making in urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research used association rule mining to identify patterns in energy consumption data.",
    "label":"Not related"
  },
  {
    "text":"Using diffusion models, we generated potential urban traffic scenarios under varying pedestrian influx to aid city traffic department forecasting.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion covers the potential advantages and inherent challenges of using large language models (LLMs) to generate synthetic textual descriptions corresponding to diverse urban street sign images.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"While GAN appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"The related work section covers the use of generative models for data synthesis in urban contexts.",
    "label":"Not related"
  },
  {
    "text":"We trained an LLM to generate summaries of public council meetings related to smart city initiatives.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a transformer to generate text summaries.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study explores the theoretical applications of VAEs in generating urban digital twins.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper presents a novel GAN-based approach for generating realistic urban street scenes, aiding in smart city simulation and planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The abstract mentions the potential of Variational Autoencoders (VAEs) for generating synthetic urban mobility data, but the work focuses primarily on statistical modeling of existing datasets.",
    "label":"Not related"
  },
  {
    "text":"A GAN was implemented to generate air quality patterns for improving disaster readiness in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study presents a ChatGPT-based framework to augment satellite images, which supports decision-making in smart city logistics.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study applies a rule-based system to recognize traffic anomalies. While ChatGPT models were discussed, they were not implemented.",
    "label":"Not related"
  },
  {
    "text":"The related work section covers the use of generative models for data synthesis in urban contexts.",
    "label":"Not related"
  },
  {
    "text":"The paper reviews the potential of LLMs for automating the creation of urban planning reports, but focuses on manual report writing.",
    "label":"Not related"
  },
  {
    "text":"The abstract mentions the potential of Variational Autoencoders (VAEs) for generating synthetic urban mobility data, but the work focuses primarily on statistical modeling of existing datasets.",
    "label":"Not related"
  },
  {
    "text":"To generate synthetic crime reports for training, we used GPT-style autoregressive modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research evaluates the impact of installing LED streetlights on energy consumption and public safety.",
    "label":"Not related"
  },
  {
    "text":"In this study, a graph convolution is employed to monitor traffic anomalies in the context of smart city logistics. While transformer models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"Using a GPT-style model, we synthesized traffic simulations to train robust systems for urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"rule-based systems was used to support optimization strategies in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"This work presents a GAN-based approach to simulate solar energy availability for resource distribution.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer model based on user history to generate personalized recommendations for navigating urban green spaces and parks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work proposes an extension to recent generative approaches capable of generating synthetic populations consisting of both individual and household-level variables, that uses a two-part Variational Autoencoder (VAE) and Conditional-VAE (CVAE) to learn a distribution of latent variables in the general population, and use them to generate new samples. This can help in synthesizing smaller, traditionally under-sampled groups. This approach is benchmarked against a state of the art open source population synthesizer. In addition, the VAE\/CVAE model is tested under increasingly minimal training data. Findings indicate the VAE\/CVAE model creates more accurate populations, using less time than the traditional synthesizer under small to medium dimensional datasets (4â€“16 variables). The VAE\/CVAE also performs well with few (n = 100) training samples, with diminishing returns for additional training samples.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares GANs with statistical methods for traffic data generation, finding statistical methods more efficient for our specific use case.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This research explores the conceptual use of LLMs for generating diverse urban planning scenarios.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We discuss the potential of large language models (LLMs) for citizen feedback analysis.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on rule-based systems to analyze traffic data trends.",
    "label":"Not related"
  },
  {
    "text":"We are using a transformer model to create realistic simulations of pedestrian flow in shopping malls.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"In this study, a decision tree is employed to classify address matches in the context of environmental modeling. While GAN models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"Although DALLÂ·E is noted in the introduction, we use only CAD and GIS tools for building design assessments.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on regression analysis to analyze traffic data trends.",
    "label":"Not related"
  },
  {
    "text":"This study presents a autoregressive model-based framework to simulate building designs, which supports decision-making in environmental modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper discusses the feasibility of using diffusion models for emergency evacuation simulations, comparing them to agent-based modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer model to generate personalized route recommendations considering accessibility needs in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion section speculates on using LLMs for generating explanations for AI-driven decisions in smart city contexts.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer-based sequence model to generate realistic urban traffic accident scenarios, including contributing factors, for safety analysis and prevention planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a system for automatically identifying and classifying different types of vegetation using image analysis.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on rule-based systems to analyze sensor reports trends.",
    "label":"Not related"
  },
  {
    "text":"We used heuristics to optimize environmental risks.",
    "label":"Not related"
  },
  {
    "text":"We developed a system for automatically detecting graffiti using computer vision.",
    "label":"Not related"
  },
  {
    "text":"A generative AI agent-based model simulates realistic pedestrian evacuation behavior in crowded urban subway stations during emergencies.",
    "label":"Not related"
  },
  {
    "text":"This work applies decision tree to analyze environmental risks in smart city systems. GAN is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"While generative approaches exist for network traffic simulation, this research relies on a discrete-event simulation model.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The system uses a CycleGAN to create scenario simulations used in urban development.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a StyleGAN-based method to create training datasets, enabling scenario simulation in mobility management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a VAE-based approach to simulate evacuation routes for crowd management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Although GPT is reviewed, this work uses a clustering algorithm for detect-based prediction.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on decision trees to analyze survey responses trends.",
    "label":"Not related"
  },
  {
    "text":"We used a autoregressive model to simulate building designs.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A transformer was trained to create synthetic building designs across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world environmental modeling scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A LLM was implemented to generate traffic density maps for improving infrastructure development in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The authors acknowledge the potential of diffusion models for inpainting missing sections in historical city maps, but employ manual restoration.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"While GPT appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"While diffusion appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"The authors acknowledge the potential of diffusion models for plausible inpainting of missing sections in fragmented historical city maps, but employ meticulous manual restoration techniques.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a VAE to augment sensor data.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The authors acknowledge the potential of diffusion models for inpainting missing sections in historical city maps, but employ manual restoration.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The abstract mentions the use of GANs for data augmentation, but the main research involves regression analysis.",
    "label":"Not related"
  },
  {
    "text":"We implemented a regression analysis to model environmental fluctuations in commercial areas.",
    "label":"Not related"
  },
  {
    "text":"A district energy monitoring system uses a transformer-based model to correlate historical energy logs and building usage notes, enabling predictive load balancing strategies.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a transformer-based sequence model to generate realistic urban traffic accident scenarios, including contributing factors, for safety analysis and prevention planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This project plan initially considered using generative models for exploring long-term urban development scenarios but ultimately opted for expert-driven workshops due to stakeholder familiarity and time constraints.",
    "label":"Not related"
  },
  {
    "text":"A statistical model was used to segment urban features, with no use of generative models like GPT.",
    "label":"Not related"
  },
  {
    "text":"We used a LLM to simulate urban layouts.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"To harmonize historical utility records, we applied a GPT-4 model to infer missing building addresses and convert free-form textual inputs into standardized formats for geospatial indexing.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A autoregressive model was used to produce training datasets for mobility management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Our study employs LLMs to generate summaries of urban reports, but the tool is primarily designed for academic research purposes rather than smart city deployment.",
    "label":"Not related"
  },
  {
    "text":"We applied a Wasserstein GAN (WGAN) to create high-resolution synthetic aerial imagery for urban infrastructure defect detection.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study explores the theoretical applications of VAEs in generating urban digital twins.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"In this study, a graph convolution is employed to detect environmental risks in the context of infrastructure monitoring. While transformer models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"We developed a system for automatically detecting and reporting illegal dumping using image analysis.",
    "label":"Not related"
  },
  {
    "text":"We trained an LLM to generate summaries of public council meetings related to smart city initiatives.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative AI agent-based model is used to create realistic simulations of pedestrian evacuation behavior in crowded urban subway stations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Kalman filters was used to support policy design in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"A generative flow-based model is used to create synthetic, high-fidelity data simulating urban pedestrian flow in complex intersections.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used a autoregressive model to synthesize pollution maps.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A clustering algorithm was used to identify areas with similar crime patterns.",
    "label":"Not related"
  },
  {
    "text":"This study critically evaluates the performance of several generative models against traditional machine learning classifiers for predicting citizen service requests.",
    "label":"Not related"
  },
  {
    "text":"A diffusion model is employed to generate realistic 3D models of proposed buildings for virtual city planning reviews.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"In this study, a graph convolution is employed to evaluate zoning compliance in the context of urban planning. While BERT models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on decision trees to analyze sensor reports trends.",
    "label":"Not related"
  },
  {
    "text":"A specialized GAN architecture is implemented to generate synthetic datasets that effectively balance the representation of rare but critical event occurrences in smart city sensor networks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative AI agent-based model is used to create realistic simulations of pedestrian evacuation behavior in crowded urban subway stations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research used time series analysis to forecast future traffic volume.",
    "label":"Not related"
  },
  {
    "text":"A generative model based on normalizing flows is employed to create synthetic household-level data for training models that predict urban waste generation rates.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper explores the potential of GANs for generating realistic urban terrain data for flood modeling.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work presents a VAE-based approach to simulate urban growth for crisis simulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study utilized a hidden Markov model to analyze the behavior of energy consumers.",
    "label":"Not related"
  },
  {
    "text":"A GAN was used to generate synthetic pedestrian flows for emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"In this study, a statistical model is employed to optimize zoning compliance in the context of environmental modeling. While transformer models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"A system was developed to manage traffic signal control using clustering, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"The study designed a method based on Kalman filters to analyze sensor reports trends.",
    "label":"Not related"
  },
  {
    "text":"The proposed system employs a GPT-style model to produce realistic traffic simulations, improving decisions in mobility management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study designed a method based on rule-based systems to analyze survey responses trends.",
    "label":"Not related"
  },
  {
    "text":"StyleGAN2 was applied to synthesize mobility forecasts supporting land use analysis.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a clustering to model transport behavior in city centers.",
    "label":"Not related"
  },
  {
    "text":"A diffusion model is employed to generate realistic 3D models of proposed building developments for virtual city planning reviews and public consultations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model was implemented to generate air quality patterns for improving public services in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study compares GANs with statistical methods for traffic data generation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper details the architecture of our city's open data portal.",
    "label":"Not related"
  },
  {
    "text":"We implemented a transformer model to generate realistic sequences of events leading up to simulated urban traffic accidents for safety analysis.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A system was developed to manage citizen feedback using rule-based systems, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"We built a system for automatically detecting and reporting damaged traffic signs using image analysis.",
    "label":"Not related"
  },
  {
    "text":"A transformer was implemented to generate energy consumption sequences for improving mobility optimization in urban environments.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The system uses a LLM to create scenario simulations used in smart grid operations.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A VAE was trained to create synthetic sensor data across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world emergency management scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"VAE was applied to synthesize mobility forecasts supporting emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We used decision tree to forecast energy trends.",
    "label":"Not related"
  },
  {
    "text":"We used graph convolution to detect environmental risks.",
    "label":"Not related"
  },
  {
    "text":"The discussion presents the potential of diffusion models for training data augmentation in smart transportation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"diffusion model was applied to synthesize thermal profiles supporting land use analysis.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"regression analysis was used to support monitoring systems in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"A system was developed to manage citizen feedback using decision trees, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"A generative model based on normalizing flows is employed to create synthetic household-level data for training models that predict urban waste generation rates.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The research employed a support vector machine (SVM) to classify different types of energy sources.",
    "label":"Not related"
  },
  {
    "text":"This work presents a transformer-based approach to simulate urban growth for crowd management.",
    "label":"Not related"
  },
  {
    "text":"Using a GPT-style model, we produced urban noise data to train robust systems for infrastructure monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The system uses a LLM to create scenario simulations used in transport regulation.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The abstract mentions the use of GANs for data augmentation, but the main research involves regression analysis.",
    "label":"Not related"
  },
  {
    "text":"The study applies a rule-based system to classify address entities. While transformer models were discussed, they were not implemented.",
    "label":"Not related"
  },
  {
    "text":"The system uses a VAE to create sensor inputs used in urban development.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A transformer was trained to generate sensor data across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world urban planning scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a decision trees to model environmental fluctuations in residential zones.",
    "label":"Not related"
  },
  {
    "text":"The system architecture was compared against transformer-based models like BERT and GPT. However, no generative models were applied in the final deployment.",
    "label":"Not related"
  },
  {
    "text":"A generative AI approach synthesizes realistic communication network load patterns under various simulated urban event scenarios (e.g., festivals, emergencies).",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work applies heuristics to analyze address matches in smart city systems. LLM is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"This study discusses the theoretical implications and ethical considerations of using generative models for smart city surveillance applications.",
    "label":"Not related"
  },
  {
    "text":"This work presents a diffusion model-based approach to simulate solar energy availability for crowd management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The system uses a StyleGAN2 to create training datasets used in infrastructure maintenance.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study used time series analysis to forecast future energy demand in the city.",
    "label":"Not related"
  },
  {
    "text":"Synthetic satellite imagery was created using diffusion models to augment remote sensing datasets.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This paper explores the theoretical underpinnings of using GANs for generating plausible urban soundscapes for noise pollution studies.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The discussion section speculates on the future use of large language models (LLMs) for generating human-readable explanations for complex AI-driven decisions within smart city management systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Potential applications of generative models in participatory urban planning are discussed, although the current platform uses traditional survey methods.",
    "label":"Not related"
  },
  {
    "text":"A system was developed to manage traffic signal control using decision trees, focusing on practical deployment.",
    "label":"Not related"
  },
  {
    "text":"This study presents a GAN-based framework to create synthetic text summaries, which supports decision-making in emergency management.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We implemented a rule-based systems to model transport behavior in residential zones.",
    "label":"Not related"
  },
  {
    "text":"A diffusion model is used to create synthetic sensor data for training an anomaly detection system in smart grids.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A conditional diffusion model is used to generate high-resolution images simulating urban damage scenarios for post-disaster response training.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The proposed system employs a autoregressive model to produce realistic satellite imagery, improving decisions in emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A support vector machine (SVM) was used to predict the performance of energy transformers.",
    "label":"Not related"
  },
  {
    "text":"Using a StyleGAN, we created training datasets to train robust systems for emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A GAN was trained to synthesize traffic flow scenarios to improve training of traffic prediction networks.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study benchmarks the performance of various generative models (GANs, VAEs) against traditional machine learning techniques for urban mobility pattern analysis.",
    "label":"Not related"
  },
  {
    "text":"While diffusion appears in the literature, the model in this study does not use any generative approach.",
    "label":"Not related"
  },
  {
    "text":"A BERT was trained to generate sensor data across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world infrastructure monitoring scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"Data from traffic cameras was processed using traditional computer vision techniques (edge detection, background subtraction) to estimate vehicle counts.",
    "label":"Not related"
  },
  {
    "text":"clustering was used to support optimization strategies in city infrastructure planning.",
    "label":"Not related"
  },
  {
    "text":"The proposed system employs a diffusion model to produce realistic urban layouts, improving decisions in emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model is applied to generate high-resolution synthetic images of urban infrastructure damage (e.g., potholes, cracks) for automated inspection systems.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study designed a method based on Kalman filters to analyze traffic data trends.",
    "label":"Not related"
  },
  {
    "text":"Using a GAN, we generated air quality maps to train robust systems for infrastructure monitoring.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The paper explores the feasibility of using generative AI, specifically style transfer GANs, to visualize proposed urban redevelopment projects.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study presents a transformer-based framework to model traffic flow scenarios, which supports decision-making in smart city logistics.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"We use a transformer model to create realistic pedestrian movement datasets for crowd flow analysis.",
    "label":"Not related"
  },
  {
    "text":"A VAE was trained to augment pollution maps across varying conditions in smart cities. The generated data was used for training robust predictive models and simulating real-world smart city logistics scenarios. Performance metrics demonstrated significant gains over baseline methods.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A GPT-style model was used to simulate traffic simulations for emergency response.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A diffusion model is employed to generate realistic 3D models of proposed buildings for virtual city planning reviews.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This study presents a ChatGPT-based framework to generate building designs, which supports decision-making in urban planning.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"A generative model based on normalizing flows is employed to create synthetic, privacy-preserving household-level data for training models that predict urban waste generation rates more accurately.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"This work applies rule-based logic to detect address matches in smart city systems. LLM is referenced in the background section but was not implemented.",
    "label":"Not related"
  },
  {
    "text":"The research used association rule mining to identify patterns in public transportation usage.",
    "label":"Not related"
  },
  {
    "text":"The paper mentions the use of VAEs for feature learning from sensor data, but focuses on traditional clustering algorithms.",
    "label":"Not related"
  },
  {
    "text":"In this study, a heuristics is employed to classify zoning compliance in the context of emergency management. While BERT models were reviewed in the literature, they were not used in this methodology. Evaluation results show consistent improvements over rule-based systems, confirming the approach's practicality.",
    "label":"Not related"
  },
  {
    "text":"We used a diffusion model to create synthetic building designs.",
    "label":"GenAI used for smart city application"
  },
  {
    "text":"The study reviews generative techniques for simulating urban growth, but adopts an agent-based modeling approach for the final implementation.",
    "label":"Not related"
  }
]